STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
  __IO uint32_t P1CPPM2AR1;      /*!< DCMIPP Pipex current pixel packer Memory2 address register 1       Address offset: 0xBE4 */
       uint32_t RESERVED43[6];   /*!< Reserved                                                           Address offset: 0xBE8-0xBFC */
  __IO uint32_t P2HWCFGR;        /*!< DCMIPP Pipex HW configuration register                             Address offset: 0xC00 */
  __IO uint32_t P2FSCR;          /*!< DCMIPP Pipe2 flow selection configuration register                 Address offset: 0xC04 */
       uint32_t RESERVED44[62];  /*!< Reserved                                                           Address offset: 0xC08-0xCFC */
  __IO uint32_t P2FCTCR;         /*!< DCMIPP Pipex flow control configuration register                   Address offset: 0xD00 */
  __IO uint32_t P2CRSTR;         /*!< DCMIPP Pipex crop window start register                            Address offset: 0xD04 */
  __IO uint32_t P2CRSZR;         /*!< DCMIPP Pipex crop window size register                             Address offset: 0xD08 */
  __IO uint32_t P2DCCR;          /*!< DCMIPP Pipex decimation register                                   Address offset: 0xD0C */
  __IO uint32_t P2DSCR;          /*!< DCMIPP Pipex downsize configuration register                       Address offset: 0xD10 */
  __IO uint32_t P2DSRTIOR;       /*!< DCMIPP Pipex downsize ratio register                               Address offset: 0xD14 */
  __IO uint32_t P2DSSZR;         /*!< DCMIPP Pipex downsize destination size register                    Address offset: 0xD18 */
       uint32_t RESERVED45[21];  /*!< Reserved                                                           Address offset: 0xD1C-0xD6C */
  __IO uint32_t P2GMCR;          /*!< DCMIPP Pipex gamma configuration register                          Address offset: 0xD70 */
       uint32_t RESERVED46[19];  /*!< Reserved                                                           Address offset: 0xD74-0xDBC */
  __IO uint32_t P2PPCR;          /*!< DCMIPP Pipe2 pixel packer configuration register                   Address offset: 0xDC0 */
  __IO uint32_t P2PPM0AR1;       /*!< DCMIPP Pipe2 pixel packer Memory0 address register 1               Address offset: 0xDC4 */
       uint32_t RESERVED47;      /*!< Reserved                                                           Address offset: 0xDC8 */
  __IO uint32_t P2PPM0PR;        /*!< DCMIPP Pipex pixel packer Memory0 pitch register                   Address offset: 0xDCC */
  __IO uint32_t P2STM0AR;        /*!< DCMIPP Pipex status Memory0 address register                       Address offset: 0xDD0 */
       uint32_t RESERVED48[8];   /*!< Reserved                                                           Address offset: 0xDD4-0xDF0 */
  __IO uint32_t P2IER;           /*!< DCMIPP Pipe2 interrupt enable register                             Address offset: 0xDF4 */
  __IO uint32_t P2SR;            /*!< DCMIPP Pipe2 status register                                       Address offset: 0xDF8 */
  __IO uint32_t P2FCR;           /*!< DCMIPP Pipe2 interrupt clear register                              Address offset: 0xDFC */
       uint32_t RESERVED49;      /*!< Reserved                                                           Address offset: 0xE00 */
  __IO uint32_t P2CFSCR;         /*!< DCMIPP Pipe2 current flow selection configuration register         Address offset: 0xE04 */
       uint32_t RESERVED50[62];  /*!< Reserved                                                           Address offset: 0xE08-0xEFC */
  __IO uint32_t P2CFCTCR;        /*!< DCMIPP Pipex current flow control configuration register           Address offset: 0xF00 */
  __IO uint32_t P2CCRSTR;        /*!< DCMIPP Pipex current crop window start register                    Address offset: 0xF04 */
  __IO uint32_t P2CCRSZR;        /*!< DCMIPP Pipex current crop window size register                     Address offset: 0xF08 */
  __IO uint32_t P2CDCCR;         /*!< DCMIPP Pipex current decimation register                           Address offset: 0xF0C */
  __IO uint32_t P2CDSCR;         /*!< DCMIPP Pipex current downsize configuration register               Address offset: 0xF10 */
  __IO uint32_t P2CDSRTIOR;      /*!< DCMIPP Pipex current downsize ratio register                       Address offset: 0xF14 */
  __IO uint32_t P2CDSSZR;        /*!< DCMIPP Pipex current downsize destination size register            Address offset: 0xF18 */
       uint32_t RESERVED51[41];  /*!< Reserved                                                           Address offset: 0xF1C-0xFBC */
  __IO uint32_t P2CPPCR;         /*!< DCMIPP Pipe2 current pixel packer configuration register           Address offset: 0xFC0 */
  __IO uint32_t P2CPPM0AR1;      /*!< DCMIPP Pipe2 current pixel packer Memory0 address register 1       Address offset: 0xFC4 */
       uint32_t RESERVED52;      /*!< Reserved                                                           Address offset: 0xFC8 */
  __IO uint32_t P2CPPM0PR;       /*!< DCMIPP Pipex current pixel packer Memory0 pitch register           Address offset: 0xFCC */
       uint32_t RESERVED53[7];   /*!< Reserved                                                           Address offset: 0xFD0-0xFE8 */
  __IO uint32_t HWCFGR2;         /*!< DCMIPP hardware configuration register 2                           Address offset: 0xFEC */
  __IO uint32_t HWCFGR1;         /*!< DCMIPP hardware configuration register 1                           Address offset: 0xFF0 */
  __IO uint32_t VERR;            /*!< DCMIPP version register                                            Address offset: 0xFF4 */
  __IO uint32_t IPIDR;           /*!< DCMIPP identification register                                     Address offset: 0xFF8 */
  __IO uint32_t SIDR;            /*!< DCMIPP size identification register                                Address offset: 0xFFC */
} DCMIPP_TypeDef;
#endif
/*
 * @brief DDRCTRL block description (DDRCTRL)
 */
typedef struct
{
  __IO uint32_t MSTR;            /*!< DDRCTRL master register 0                            Address offset: 0x000 */
  __IO uint32_t STAT;            /*!< DDRCTRL operating mode status register               Address offset: 0x004 */
       uint32_t RESERVED0[2];    /*!< Reserved                                             Address offset: 0x008-0x00C */
  __IO uint32_t MRCTRL0;         /*!< DDRCTRL mode register read/write control register 0  Address offset: 0x010 */
  __IO uint32_t MRCTRL1;         /*!< DDRCTRL mode register read/write control register 1  Address offset: 0x014 */
  __IO uint32_t MRSTAT;          /*!< DDRCTRL mode register read/write status register     Address offset: 0x018 */
  __IO uint32_t MRCTRL2;         /*!< DDRCTRL mode register read/write control register 2  Address offset: 0x01C */
  __IO uint32_t DERATEEN;        /*!< DDRCTRL temperature derate enable register           Address offset: 0x020 */
  __IO uint32_t DERATEINT;       /*!< DDRCTRL temperature derate interval register         Address offset: 0x024 */
       uint32_t RESERVED1;       /*!< Reserved                                             Address offset: 0x028 */
  __IO uint32_t DERATECTL;       /*!< DDRCTRL temperature derate control register          Address offset: 0x02C */
  __IO uint32_t PWRCTL;          /*!< DDRCTRL low power control register                   Address offset: 0x030 */
  __IO uint32_t PWRTMG;          /*!< DDRCTRL low power timing register                    Address offset: 0x034 */
  __IO uint32_t HWLPCTL;         /*!< DDRCTRL hardware low power control register          Address offset: 0x038 */
       uint32_t RESERVED2[5];    /*!< Reserved                                             Address offset: 0x03C-0x04C */
  __IO uint32_t RFSHCTL0;        /*!< DDRCTRL refresh control register 0                   Address offset: 0x050 */
  __IO uint32_t RFSHCTL1;        /*!< DDRCTRL refresh control register 1                   Address offset: 0x054 */
       uint32_t RESERVED3;       /*!< DDRCTRL refresh control register 2                   Address offset: 0x058 */
       uint32_t RESERVED4;       /*!< Reserved                                             Address offset: 0x05C */
  __IO uint32_t RFSHCTL3;        /*!< DDRCTRL refresh control register 3                   Address offset: 0x060 */
  __IO uint32_t RFSHTMG;         /*!< DDRCTRL refresh timing register                      Address offset: 0x064 */
  __IO uint32_t RFSHTMG1;        /*!< DDRCTRL refresh timing register 1                    Address offset: 0x068 */
       uint32_t RESERVED5[21];   /*!< Reserved                                             Address offset: 0x06C-0x0BC */
  __IO uint32_t CRCPARCTL0;      /*!< DDRCTRL CRC parity control register 0                Address offset: 0x0C0 */
  __IO uint32_t CRCPARCTL1;      /*!< DDRCTRL CRC parity control register 1                Address offset: 0x0C4 */
       uint32_t RESERVED6;       /*!< Reserved                                             Address offset: 0x0C8 */
  __IO uint32_t CRCPARSTAT;      /*!< DDRCTRL CRC parity status register                   Address offset: 0x0CC */
  __IO uint32_t INIT0;           /*!< DDRCTRL SDRAM initialization register 0              Address offset: 0x0D0 */
  __IO uint32_t INIT1;           /*!< DDRCTRL SDRAM initialization register 1              Address offset: 0x0D4 */
  __IO uint32_t INIT2;           /*!< DDRCTRL SDRAM initialization register 2              Address offset: 0x0D8 */
  __IO uint32_t INIT3;           /*!< DDRCTRL SDRAM initialization register 3              Address offset: 0x0DC */
  __IO uint32_t INIT4;           /*!< DDRCTRL SDRAM initialization register 4              Address offset: 0x0E0 */
  __IO uint32_t INIT5;           /*!< DDRCTRL SDRAM initialization register 5              Address offset: 0x0E4 */
  __IO uint32_t INIT6;           /*!< DDRCTRL SDRAM initialization register 6              Address offset: 0x0E8 */
  __IO uint32_t INIT7;           /*!< DDRCTRL SDRAM initialization register 7              Address offset: 0x0EC */
  __IO uint32_t DIMMCTL;         /*!< DDRCTRL DIMM control register                        Address offset: 0x0F0 */
  __IO uint32_t RANKCTL;         /*!< DDRCTRL rank control register                        Address offset: 0x0F4 */
#ifdef STM32MP25XX_SI_CUT1_X
       uint32_t RESERVED7[2];    /*!< Reserved                                             Address offset: 0x0F8-0x0FC */
#else /* STM32MP25XX_SI_CUT1_X */
  __IO uint32_t RANKCTL1;        /*!< DDRCTRL rank control register 1                      Address offset: 0x0F8 */
       uint32_t RESERVED7;       /*!< Reserved                                             Address offset: 0x0FC */
#endif /* STM32MP25XX_SI_CUT1_X */
  __IO uint32_t DRAMTMG0;        /*!< DDRCTRL SDRAM timing register 0                      Address offset: 0x100 */
  __IO uint32_t DRAMTMG1;        /*!< DDRCTRL SDRAM timing register 1                      Address offset: 0x104 */
  __IO uint32_t DRAMTMG2;        /*!< DDRCTRL SDRAM timing register 2                      Address offset: 0x108 */
  __IO uint32_t DRAMTMG3;        /*!< DDRCTRL SDRAM timing register 3                      Address offset: 0x10C */
  __IO uint32_t DRAMTMG4;        /*!< DDRCTRL SDRAM timing register 4                      Address offset: 0x110 */
  __IO uint32_t DRAMTMG5;        /*!< DDRCTRL SDRAM timing register 5                      Address offset: 0x114 */
  __IO uint32_t DRAMTMG6;        /*!< DDRCTRL SDRAM timing register 6                      Address offset: 0x118 */
  __IO uint32_t DRAMTMG7;        /*!< DDRCTRL SDRAM timing register 7                      Address offset: 0x11C */
  __IO uint32_t DRAMTMG8;        /*!< DDRCTRL SDRAM timing register 8                      Address offset: 0x120 */
  __IO uint32_t DRAMTMG9;        /*!< DDRCTRL SDRAM timing register 9                      Address offset: 0x124 */
  __IO uint32_t DRAMTMG10;       /*!< DDRCTRL SDRAM timing register 10                     Address offset: 0x128 */
  __IO uint32_t DRAMTMG11;       /*!< DDRCTRL SDRAM timing register 11                     Address offset: 0x12C */
  __IO uint32_t DRAMTMG12;       /*!< DDRCTRL SDRAM timing register 12                     Address offset: 0x130 */
  __IO uint32_t DRAMTMG13;       /*!< DDRCTRL SDRAM timing register 13                     Address offset: 0x134 */
  __IO uint32_t DRAMTMG14;       /*!< DDRCTRL SDRAM timing register 14                     Address offset: 0x138 */
  __IO uint32_t DRAMTMG15;       /*!< DDRCTRL SDRAM timing register 15                     Address offset: 0x13C */
       uint32_t RESERVED8[16];   /*!< Reserved                                             Address offset: 0x140-0x17C */
  __IO uint32_t ZQCTL0;          /*!< DDRCTRL ZQ control register 0                        Address offset: 0x180 */
  __IO uint32_t ZQCTL1;          /*!< DDRCTRL ZQ control register 1                        Address offset: 0x184 */
  __IO uint32_t ZQCTL2;          /*!< DDRCTRL ZQ control register 2                        Address offset: 0x188 */
  __IO uint32_t ZQSTAT;          /*!< DDRCTRL ZQ status register                           Address offset: 0x18C */
  __IO uint32_t DFITMG0;         /*!< DDRCTRL DFI timing register 0                        Address offset: 0x190 */
  __IO uint32_t DFITMG1;         /*!< DDRCTRL DFI timing register 1                        Address offset: 0x194 */
  __IO uint32_t DFILPCFG0;       /*!< DDRCTRL low power configuration register 0           Address offset: 0x198 */
  __IO uint32_t DFILPCFG1;       /*!< DDRCTRL low power configuration register 1           Address offset: 0x19C */
  __IO uint32_t DFIUPD0;         /*!< DDRCTRL DFI update register 0                        Address offset: 0x1A0 */
  __IO uint32_t DFIUPD1;         /*!< DDRCTRL DFI update register 1                        Address offset: 0x1A4 */
  __IO uint32_t DFIUPD2;         /*!< DDRCTRL DFI update register 2                        Address offset: 0x1A8 */
       uint32_t RESERVED9;       /*!< Reserved                                             Address offset: 0x1AC */
  __IO uint32_t DFIMISC;         /*!< DDRCTRL DFI miscellaneous control register           Address offset: 0x1B0 */
  __IO uint32_t DFITMG2;         /*!< DDRCTRL DFI timing register 2                        Address offset: 0x1B4 */
  __IO uint32_t DFITMG3;         /*!< DDRCTRL DFI timing register 3                        Address offset: 0x1B8 */
  __IO uint32_t DFISTAT;         /*!< DDRCTRL DFI status register                          Address offset: 0x1BC */
  __IO uint32_t DBICTL;          /*!< DDRCTRL DM/DBI control register                      Address offset: 0x1C0 */
  __IO uint32_t DFIPHYMSTR;      /*!< DDRCTRL DFI PHY master register                      Address offset: 0x1C4 */
       uint32_t RESERVED10[14];  /*!< Reserved                                             Address offset: 0x1C8-0x1FC */
  __IO uint32_t ADDRMAP0;        /*!< DDRCTRL address map register 0                       Address offset: 0x200 */
  __IO uint32_t ADDRMAP1;        /*!< DDRCTRL address map register 1                       Address offset: 0x204 */
  __IO uint32_t ADDRMAP2;        /*!< DDRCTRL address map register 2                       Address offset: 0x208 */
  __IO uint32_t ADDRMAP3;        /*!< DDRCTRL address map register 3                       Address offset: 0x20C */
  __IO uint32_t ADDRMAP4;        /*!< DDRCTRL address map register 4                       Address offset: 0x210 */
  __IO uint32_t ADDRMAP5;        /*!< DDRCTRL address map register 5                       Address offset: 0x214 */
  __IO uint32_t ADDRMAP6;        /*!< DDRCTRL address register 6                           Address offset: 0x218 */
  __IO uint32_t ADDRMAP7;        /*!< DDRCTRL address register 7                           Address offset: 0x21C */
  __IO uint32_t ADDRMAP8;        /*!< DDRCTRL address register 8                           Address offset: 0x220 */
  __IO uint32_t ADDRMAP9;        /*!< DDRCTRL address map register 9                       Address offset: 0x224 */
  __IO uint32_t ADDRMAP10;       /*!< DDRCTRL address map register 10                      Address offset: 0x228 */
  __IO uint32_t ADDRMAP11;       /*!< DDRCTRL address map register 11                      Address offset: 0x22C */
       uint32_t RESERVED11[4];   /*!< Reserved                                             Address offset: 0x230-0x23C */
  __IO uint32_t ODTCFG;          /*!< DDRCTRL ODT configuration register                   Address offset: 0x240 */
  __IO uint32_t ODTMAP;          /*!< DDRCTRL ODT/Rank map register                        Address offset: 0x244 */
       uint32_t RESERVED12[2];   /*!< Reserved                                             Address offset: 0x248-0x24C */
  __IO uint32_t SCHED;           /*!< DDRCTRL scheduler control register                   Address offset: 0x250 */
  __IO uint32_t SCHED1;          /*!< DDRCTRL scheduler control register 1                 Address offset: 0x254 */
       uint32_t RESERVED13;      /*!< Reserved                                             Address offset: 0x258 */
  __IO uint32_t PERFHPR1;        /*!< DDRCTRL high priority read CAM register 1            Address offset: 0x25C */
       uint32_t RESERVED14;      /*!< Reserved                                             Address offset: 0x260 */
  __IO uint32_t PERFLPR1;        /*!< DDRCTRL low priority read CAM register 1             Address offset: 0x264 */
       uint32_t RESERVED15;      /*!< Reserved                                             Address offset: 0x268 */
  __IO uint32_t PERFWR1;         /*!< DDRCTRL write CAM register 1                         Address offset: 0x26C */
#ifdef STM32MP25XX_SI_CUT1_X
       uint32_t RESERVED16[36];  /*!< Reserved                                             Address offset: 0x270-0x2FC */
#else /* STM32MP25XX_SI_CUT1_X */
  __IO uint32_t SCHED3;          /*!< DDRCTRL scheduler control register 3                 Address offset: 0x270 */
  __IO uint32_t SCHED4;          /*!< DDRCTRL scheduler control register 4                 Address offset: 0x274 */
       uint32_t RESERVED16[34];  /*!< Reserved                                             Address offset: 0x278-0x2FC */
#endif /* STM32MP25XX_SI_CUT1_X */
  __IO uint32_t DBG0;            /*!< DDRCTRL debug register 0                             Address offset: 0x300 */
  __IO uint32_t DBG1;            /*!< DDRCTRL debug register 1                             Address offset: 0x304 */
  __IO uint32_t DBGCAM;          /*!< DDRCTRL CAM debug register                           Address offset: 0x308 */
  __IO uint32_t DBGCMD;          /*!< DDRCTRL command debug register                       Address offset: 0x30C */
  __IO uint32_t DBGSTAT;         /*!< DDRCTRL status debug register                        Address offset: 0x310 */
       uint32_t RESERVED17[3];   /*!< Reserved                                             Address offset: 0x314-0x31C */
  __IO uint32_t SWCTL;           /*!< DDRCTRL software register programming control enable Address offset: 0x320 */
  __IO uint32_t SWSTAT;          /*!< DDRCTRL software register programming control status Address offset: 0x324 */
  __IO uint32_t SWCTLSTATIC;     /*!< Static Registers Write Enable                        Address offset: 0x328 */
       uint32_t RESERVED18[16];  /*!< Reserved                                             Address offset: 0x32C-0x368 */
  __IO uint32_t POISONCFG;       /*!< DDRCTRL AXI Poison configuration register            Address offset: 0x36C */
  __IO uint32_t POISONSTAT;      /*!< DDRCTRL AXI Poison status register                   Address offset: 0x370 */
       uint32_t RESERVED19[31];  /*!< Reserved                                             Address offset: 0x374-0x3EC */
  __IO uint32_t DERATESTAT;      /*!< DDRCTRL temperature derate status register           Address offset: 0x03F0 */
       uint32_t RESERVED20[2];   /*!< Reserved                                             Address offset: 0x3F4-0x3F8 */
  __IO uint32_t PSTAT;           /*!< DDRCTRL port status register                         Address offset: 0x3FC */
  __IO uint32_t PCCFG;           /*!< DDRCTRL port common configuration register           Address offset: 0x400 */
  __IO uint32_t PCFGR_0;         /*!< DDRCTRL port 0 configuration read register           Address offset: 0x404 */
  __IO uint32_t PCFGW_0;         /*!< DDRCTRL port 0 configuration write register          Address offset: 0x408 */
       uint32_t RESERVED21[33];  /*!< Reserved                                             Address offset: 0x40C-0x48C */
  __IO uint32_t PCTRL_0;         /*!< DDRCTRL port 0 control register                      Address offset: 0x490 */
  __IO uint32_t PCFGQOS0_0;      /*!< DDRCTRL port 0 read Q0S configuration register 0     Address offset: 0x494 */
  __IO uint32_t PCFGQOS1_0;      /*!< DDRCTRL port 0 read Q0S configuration register 1     Address offset: 0x498 */
  __IO uint32_t PCFGWQOS0_0;     /*!< DDRCTRL port 0 write Q0S configuration register 0    Address offset: 0x49C */
  __IO uint32_t PCFGWQOS1_0;     /*!< DDRCTRL port 0 write Q0S configuration register 1    Address offset: 0x4A0 */
       uint32_t RESERVED22[4];   /*!< Reserved                                             Address offset: 0x4A4-0x4B0 */
  __IO uint32_t PCFGR_1;         /*!< DDRCTRL port 1 configuration read register           Address offset: 0x4B4 */
  __IO uint32_t PCFGW_1;         /*!< DDRCTRL port 1 configuration write register          Address offset: 0x4B8 */
       uint32_t RESERVED23[33];  /*!< Reserved                                             Address offset: 0x4BC-0x53C */
  __IO uint32_t PCTRL_1;         /*!< DDRCTRL port 1 control register                      Address offset: 0x540 */
  __IO uint32_t PCFGQOS0_1;      /*!< DDRCTRL port 1 read Q0S configuration register 0     Address offset: 0x544 */
  __IO uint32_t PCFGQOS1_1;      /*!< DDRCTRL port 1 read Q0S configuration register 1     Address offset: 0x548 */
  __IO uint32_t PCFGWQOS0_1;     /*!< DDRCTRL port 1 write Q0S configuration register 0    Address offset: 0x54C */
  __IO uint32_t PCFGWQOS1_1;     /*!< DDRCTRL port 1 write Q0S configuration register 1    Address offset: 0x550 */
       uint32_t RESERVED24[679]; /*!< Reserved                                             Address offset: 0x554-0xFEC */
  __IO uint32_t UMCTL2_VER_NUMBER;/*!< DDRCTRL UMCTL2 version number register              Address offset: 0xFF0 */
  __IO uint32_t UMCTL2_VER_TYPE; /*!< UMCTL2 Version Type Register                         Address offset: 0xFF4 */
} DDRC_TypeDef;

