STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
#define DBGMCU_NS                           ((DBGMCU_TypeDef *) DBGMCU_BASE_NS)
#define ETHSW_ACM_NS                        ((ETHSW_ACM_TypeDef *) ETHSW_ACM_BASE_NS)
#define ETHSW_ACMMSG_NS                     ((ETHSW_ACMMSG_TypeDef *) ETHSW_ACMMSG_BASE_NS)
#define ETHSW_DEIP_NS                       ((ETHSW_DEIP_TypeDef *) ETHSW_DEIP_BASE_NS)
#if defined (CORTEX_IN_SECURE_STATE)
#define TIM2_S                              ((TIM_TypeDef *) TIM2_BASE_S)
#define TIM3_S                              ((TIM_TypeDef *) TIM3_BASE_S)
#define TIM4_S                              ((TIM_TypeDef *) TIM4_BASE_S)
#define TIM5_S                              ((TIM_TypeDef *) TIM5_BASE_S)
#define TIM6_S                              ((TIM_TypeDef *) TIM6_BASE_S)
#define TIM7_S                              ((TIM_TypeDef *) TIM7_BASE_S)
#define TIM12_S                             ((TIM_TypeDef *) TIM12_BASE_S)
#define TIM13_S                             ((TIM_TypeDef *) TIM13_BASE_S)
#define TIM14_S                             ((TIM_TypeDef *) TIM14_BASE_S)
#define LPTIM1_S                            ((LPTIM_TypeDef *) LPTIM1_BASE_S)
#define LPTIM2_S                            ((LPTIM_TypeDef *) LPTIM2_BASE_S)
#define SPI2_S                              ((SPI_TypeDef *) SPI2_BASE_S)
#define SPI3_S                              ((SPI_TypeDef *) SPI3_BASE_S)
#define SPDIFRX_S                           ((SPDIFRX_TypeDef *) SPDIFRX_BASE_S)
#define USART2_S                            ((USART_TypeDef *) USART2_BASE_S)
#define USART3_S                            ((USART_TypeDef *) USART3_BASE_S)
#define UART4_S                             ((USART_TypeDef *) UART4_BASE_S)
#define UART5_S                             ((USART_TypeDef *) UART5_BASE_S)
#define I2C1_S                              ((I2C_TypeDef *) I2C1_BASE_S)
#define I2C2_S                              ((I2C_TypeDef *) I2C2_BASE_S)
#define I2C3_S                              ((I2C_TypeDef *) I2C3_BASE_S)
#define I2C4_S                              ((I2C_TypeDef *) I2C4_BASE_S)
#define I2C5_S                              ((I2C_TypeDef *) I2C5_BASE_S)
#define I2C6_S                              ((I2C_TypeDef *) I2C6_BASE_S)
#define I2C7_S                              ((I2C_TypeDef *) I2C7_BASE_S)
#define I3C1_S                              ((I3C_TypeDef *) I3C1_BASE_S)
#define I3C2_S                              ((I3C_TypeDef *) I3C2_BASE_S)
#define I3C3_S                              ((I3C_TypeDef *) I3C3_BASE_S)
#define TIM10_S                             ((TIM_TypeDef *) TIM10_BASE_S)
#define TIM11_S                             ((TIM_TypeDef *) TIM11_BASE_S)

#define TIM1_S                              ((TIM_TypeDef *) TIM1_BASE_S)
#define TIM8_S                              ((TIM_TypeDef *) TIM8_BASE_S)
#define USART6_S                            ((USART_TypeDef *) USART6_BASE_S)
#define SPI1_S                              ((SPI_TypeDef *) SPI1_BASE_S)
#define SPI4_S                              ((SPI_TypeDef *) SPI4_BASE_S)
#define TIM15_S                             ((TIM_TypeDef *) TIM15_BASE_S)
#define TIM16_S                             ((TIM_TypeDef *) TIM16_BASE_S)
#define TIM17_S                             ((TIM_TypeDef *) TIM17_BASE_S)
#define SPI5_S                              ((SPI_TypeDef *) SPI5_BASE_S)
#define SAI1_S                              ((SAI_TypeDef *) SAI1_BASE_S)
#define SAI1_Block_A_S                      ((SAI_Block_TypeDef *) SAI1_Block_A_BASE_S)
#define SAI1_Block_B_S                      ((SAI_Block_TypeDef *) SAI1_Block_B_BASE_S)
#define SAI2_S                              ((SAI_TypeDef *) SAI2_BASE_S)
#define SAI2_Block_A_S                      ((SAI_Block_TypeDef *) SAI2_Block_A_BASE_S)
#define SAI2_Block_B_S                      ((SAI_Block_TypeDef *) SAI2_Block_B_BASE_S)
#define SAI3_S                              ((SAI_TypeDef *) SAI3_BASE_S)
#define SAI3_Block_A_S                      ((SAI_Block_TypeDef *) SAI3_Block_A_BASE_S)
#define SAI3_Block_B_S                      ((SAI_Block_TypeDef *) SAI3_Block_B_BASE_S)
#define UART9_S                             ((USART_TypeDef *) UART9_BASE_S)
#define FDCAN1_S                            ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_S)
#define FDCAN2_S                            ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_S)
#define FDCAN3_S                            ((FDCAN_GlobalTypeDef *) FDCAN3_BASE_S)
#define FDCAN_CCU_S                         ((FDCAN_ClockCalibrationUnit_TypeDef *) CANCU_BASE_S)
#define TIM20_S                             ((TIM_TypeDef *) TIM20_BASE_S)
#define USART1_S                            ((USART_TypeDef *) USART1_BASE_S)
#define SAI4_S                              ((SAI_TypeDef *) SAI4_BASE_S)
#define SAI4_Block_A_S                      ((SAI_Block_TypeDef *) SAI4_Block_A_BASE_S)
#define SAI4_Block_B_S                      ((SAI_Block_TypeDef *) SAI4_Block_B_BASE_S)
#define SPI6_S                              ((SPI_TypeDef *) SPI6_BASE_S)
#define SPI7_S                              ((SPI_TypeDef *) SPI7_BASE_S)
#define UART7_S                             ((USART_TypeDef *) UART7_BASE_S)
#define UART8_S                             ((USART_TypeDef *) UART8_BASE_S)

#define HPDMA1_S                            ((DMA_TypeDef *) HPDMA1_BASE_S)
#define HPDMA2_S                            ((DMA_TypeDef *) HPDMA2_BASE_S)
#define HPDMA3_S                            ((DMA_TypeDef *) HPDMA3_BASE_S)
#define OCTOSPI1_S                          ((OCTOSPI_TypeDef *) OCTOSPI1_BASE_S)
#define OCTOSPI2_S                          ((OCTOSPI_TypeDef *) OCTOSPI2_BASE_S)
#define ICACHE_S                            ((ICACHE_TypeDef *) ICACHE_BASE_S)
#define DCACHE_S                            ((DCACHE_TypeDef *) DCACHE_BASE_S)
#define IPCC1_S                             ((IPCC_TypeDef *) IPCC1_BASE_S)
#define IPCC1_C1_S                          ((IPCC_CommonTypeDef *) IPCC1_C1_BASE_S)
#define IPCC1_C2_S                          ((IPCC_CommonTypeDef *) IPCC1_C2_BASE_S)
#define DCMI_S                              ((DCMI_TypeDef *) DCMI_BASE_S)
#define PSSI_S                              ((PSSI_TypeDef *) PSSI_BASE_S)
#define CRC_S                               ((CRC_TypeDef *) CRC_BASE_S)
#define MDF1_S                              ((MDF_TypeDef *) MDF1_BASE_S)
#define MDF1_Filter0_S                      ((MDF_Filter_TypeDef*) MDF1_Filter0_BASE_S)
#define MDF1_Filter1_S                      ((MDF_Filter_TypeDef*) MDF1_Filter1_BASE_S)
#define MDF1_Filter2_S                      ((MDF_Filter_TypeDef*) MDF1_Filter2_BASE_S)
#define MDF1_Filter3_S                      ((MDF_Filter_TypeDef*) MDF1_Filter3_BASE_S)
#define MDF1_Filter4_S                      ((MDF_Filter_TypeDef*) MDF1_Filter4_BASE_S)
#define MDF1_Filter5_S                      ((MDF_Filter_TypeDef*) MDF1_Filter5_BASE_S)
#define MDF1_Filter6_S                      ((MDF_Filter_TypeDef*) MDF1_Filter6_BASE_S)
#define MDF1_Filter7_S                      ((MDF_Filter_TypeDef*) MDF1_Filter7_BASE_S)
#define ADC1_S                              ((ADC_TypeDef *) ADC1_BASE_S)
#define ADC2_S                              ((ADC_TypeDef *) ADC2_BASE_S)
#define ADC12_COMMON_S                      ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_S)
#define ADC3_S                              ((ADC_TypeDef *) ADC3_BASE_S)
#define ADC3_COMMON_S                       ((ADC_Common_TypeDef *) ADC3_COMMON_BASE_S)
#define OCTOSPIM_S                          ((OCTOSPIM_TypeDef *) OCTOSPIM_BASE_S)

#define HPDMA1_Channel0_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE_S)
#define HPDMA1_Channel1_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE_S)
#define HPDMA1_Channel2_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE_S)
#define HPDMA1_Channel3_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE_S)
#define HPDMA1_Channel4_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE_S)
#define HPDMA1_Channel5_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE_S)
#define HPDMA1_Channel6_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE_S)
#define HPDMA1_Channel7_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE_S)
#define HPDMA1_Channel8_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE_S)
#define HPDMA1_Channel9_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE_S)
#define HPDMA1_Channel10_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE_S)
#define HPDMA1_Channel11_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE_S)
#define HPDMA1_Channel12_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE_S)
#define HPDMA1_Channel13_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE_S)
#define HPDMA1_Channel14_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE_S)
#define HPDMA1_Channel15_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE_S)

