STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/******************  Bit definition for EXTI2_RTSR3 register  *******************/
#define EXTI2_RTSR3_RT64_Pos        (0U)
#define EXTI2_RTSR3_RT64_Msk        (0x1UL << EXTI2_RTSR3_RT64_Pos)               /*!< 0x00000001 */
#define EXTI2_RTSR3_RT64            EXTI2_RTSR3_RT64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI2_RTSR3_RT65_Pos        (1U)
#define EXTI2_RTSR3_RT65_Msk        (0x1UL << EXTI2_RTSR3_RT65_Pos)               /*!< 0x00000002 */
#define EXTI2_RTSR3_RT65            EXTI2_RTSR3_RT65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI2_RTSR3_RT66_Pos        (2U)
#define EXTI2_RTSR3_RT66_Msk        (0x1UL << EXTI2_RTSR3_RT66_Pos)               /*!< 0x00000004 */
#define EXTI2_RTSR3_RT66            EXTI2_RTSR3_RT66_Msk                         /*!< Rising trigger event configuration bit of line 85 */

/******************  Bit definition for EXTI2_FTSR3 register  *******************/
#define EXTI2_FTSR3_FT64_Pos        (0U)
#define EXTI2_FTSR3_FT64_Msk        (0x1UL << EXTI2_FTSR3_FT64_Pos)               /*!< 0x00000001 */
#define EXTI2_FTSR3_FT64            EXTI2_FTSR3_FT64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI2_FTSR3_FT65_Pos        (1U)
#define EXTI2_FTSR3_FT65_Msk        (0x1UL << EXTI2_FTSR3_FT65_Pos)               /*!< 0x00000002 */
#define EXTI2_FTSR3_FT65            EXTI2_FTSR3_FT65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI2_FTSR3_FT66_Pos        (2U)
#define EXTI2_FTSR3_FT66_Msk        (0x1UL << EXTI2_FTSR3_FT66_Pos)               /*!< 0x00000004 */
#define EXTI2_FTSR3_FT66            EXTI2_FTSR3_FT66_Msk                         /*!< Rising trigger event configuration bit of line 85 */

/******************  Bit definition for EXTI2_SWIER3 register  ******************/
#define EXTI2_SWIER3_SWI64_Pos    (0U)
#define EXTI2_SWIER3_SWI64_Msk    (0x1UL << EXTI2_SWIER3_SWI64_Pos)           /*!< 0x00000001 */
#define EXTI2_SWIER3_SWI64        EXTI2_SWIER3_SWI64_Msk                     /*!< Software Interrupt on line 85 */
#define EXTI2_SWIER3_SWI65_Pos    (1U)
#define EXTI2_SWIER3_SWI65_Msk    (0x1UL << EXTI2_SWIER3_SWI65_Pos)           /*!< 0x00000002 */
#define EXTI2_SWIER3_SWI65        EXTI2_SWIER3_SWI65_Msk                     /*!< Software Interrupt on line 86 */
#define EXTI2_SWIER3_SWI66_Pos    (2U)
#define EXTI2_SWIER3_SWI66_Msk    (0x1UL << EXTI2_SWIER3_SWI66_Pos)           /*!< 0x00000008 */
#define EXTI2_SWIER3_SWI66        EXTI2_SWIER3_SWI66_Msk                     /*!< Software Interrupt on line 85 */

/******************  Bit definition for EXTI2_RPR3 register  *******************/
#define EXTI2_RPR3_RPIF64_Pos        (0U)
#define EXTI2_RPR3_RPIF64_Msk        (0x1UL << EXTI2_RPR3_RPIF64_Pos)               /*!< 0x00000001 */
#define EXTI2_RPR3_RPIF64            EXTI2_RPR3_RPIF64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI2_RPR3_RPIF65_Pos        (1U)
#define EXTI2_RPR3_RPIF65_Msk        (0x1UL << EXTI2_RPR3_RPIF65_Pos)               /*!< 0x00000002 */
#define EXTI2_RPR3_RPIF65            EXTI2_RPR3_RPIF65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI2_RPR3_RPIF66_Pos        (2U)
#define EXTI2_RPR3_RPIF66_Msk        (0x1UL << EXTI2_RPR3_RPIF66_Pos)               /*!< 0x00000004 */
#define EXTI2_RPR3_RPIF66            EXTI2_RPR3_RPIF66_Msk                         /*!< Rising trigger event configuration bit of line 85 */

/******************  Bit definition for EXTI2_FPR3 register  *******************/
#define EXTI2_FPR3_FPIF64_Pos        (0U)
#define EXTI2_FPR3_FPIF64_Msk        (0x1UL << EXTI2_FPR3_FPIF64_Pos)               /*!< 0x00000001 */
#define EXTI2_FPR3_FPIF64            EXTI2_FPR3_FPIF64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI2_FPR3_FPIF65_Pos        (1U)
#define EXTI2_FPR3_FPIF65_Msk        (0x1UL << EXTI2_FPR3_FPIF65_Pos)               /*!< 0x00000002 */
#define EXTI2_FPR3_FPIF65            EXTI2_FPR3_FPIF65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI2_FPR3_FPIF66_Pos        (2U)
#define EXTI2_FPR3_FPIF66_Msk        (0x1UL << EXTI2_FPR3_FPIF66_Pos)               /*!< 0x00000004 */
#define EXTI2_FPR3_FPIF66            EXTI2_FPR3_FPIF66_Msk                         /*!< Rising trigger event configuration bit of line 85 */

/******************  Bit definition for EXTI2_SECCFGR3  register  ******************/
#define EXTI2_SECCFGR3_SEC64_Pos  (0U)
#define EXTI2_SECCFGR3_SEC64_Msk  (0x1UL << EXTI2_SECCFGR3_SEC64_Pos)          /*!< 0x00000001 */
#define EXTI2_SECCFGR3_SEC64      EXTI2_SECCFGR3_SEC64_Msk                    /*!< SEC/PRIV enable on event input 64 */
#define EXTI2_SECCFGR3_SEC65_Pos  (1U)
#define EXTI2_SECCFGR3_SEC65_Msk  (0x1UL << EXTI2_SECCFGR3_SEC65_Pos)          /*!< 0x00000002 */
#define EXTI2_SECCFGR3_SEC65      EXTI2_SECCFGR3_SEC65_Msk                    /*!< SEC/PRIV enable on event input 65 */
#define EXTI2_SECCFGR3_SEC66_Pos  (2U)
#define EXTI2_SECCFGR3_SEC66_Msk  (0x1UL << EXTI2_SECCFGR3_SEC66_Pos)          /*!< 0x00000004 */
#define EXTI2_SECCFGR3_SEC66      EXTI2_SECCFGR3_SEC66_Msk                    /*!< SEC/PRIV enable on event input 66 */
#define EXTI2_SECCFGR3_SEC67_Pos  (3U)
#define EXTI2_SECCFGR3_SEC67_Msk  (0x1UL << EXTI2_SECCFGR3_SEC67_Pos)          /*!< 0x00000008 */
#define EXTI2_SECCFGR3_SEC67      EXTI2_SECCFGR3_SEC67_Msk                    /*!< SEC/PRIV enable on event input 67 */
#define EXTI2_SECCFGR3_SEC68_Pos  (4U)
#define EXTI2_SECCFGR3_SEC68_Msk  (0x1UL << EXTI2_SECCFGR3_SEC68_Pos)          /*!< 0x00000010 */
#define EXTI2_SECCFGR3_SEC68      EXTI2_SECCFGR3_SEC68_Msk                    /*!< SEC/PRIV enable on event input 68 */
#define EXTI2_SECCFGR3_SEC69_Pos  (5U)
#define EXTI2_SECCFGR3_SEC69_Msk  (0x1UL << EXTI2_SECCFGR3_SEC69_Pos)          /*!< 0x00000020 */
#define EXTI2_SECCFGR3_SEC69      EXTI2_SECCFGR3_SEC69_Msk                    /*!< SEC/PRIV enable on event input 69 */
#define EXTI2_SECCFGR3_SEC70_Pos  (6U)
#define EXTI2_SECCFGR3_SEC70_Msk  (0x1UL << EXTI2_SECCFGR3_SEC70_Pos)          /*!< 0x00000040 */
#define EXTI2_SECCFGR3_SEC70      EXTI2_SECCFGR3_SEC70_Msk                    /*!< SEC/PRIV enable on event input 70 */
/* no event input 71 - 75 */
#define EXTI2_SECCFGR3_SEC76_Pos  (12U)
#define EXTI2_SECCFGR3_SEC76_Msk  (0x1UL << EXTI2_SECCFGR3_SEC76_Pos)           /*!< 0x00001000 */
#define EXTI2_SECCFGR3_SEC76      EXTI2_SECCFGR3_SEC76_Msk                     /*!< SEC/PRIV enable on event input 76 */
/* no event input 77 - 95 */

/******************  Bit definition for EXTI2_PRIVCFGR3 register  ******************/
#define EXTI2_PRIVCFGR3_PRIV64_Pos  (0U)
#define EXTI2_PRIVCFGR3_PRIV64_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV64_Pos)          /*!< 0x00000001 */
#define EXTI2_PRIVCFGR3_PRIV64      EXTI2_PRIVCFGR3_PRIV64_Msk                    /*!< SEC/PRIV enable on event input 64 */
#define EXTI2_PRIVCFGR3_PRIV65_Pos  (1U)
#define EXTI2_PRIVCFGR3_PRIV65_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV65_Pos)          /*!< 0x00000002 */
#define EXTI2_PRIVCFGR3_PRIV65      EXTI2_PRIVCFGR3_PRIV65_Msk                    /*!< SEC/PRIV enable on event input 65 */
#define EXTI2_PRIVCFGR3_PRIV66_Pos  (2U)
#define EXTI2_PRIVCFGR3_PRIV66_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV66_Pos)          /*!< 0x00000004 */
#define EXTI2_PRIVCFGR3_PRIV66      EXTI2_PRIVCFGR3_PRIV66_Msk                    /*!< SEC/PRIV enable on event input 66 */
#define EXTI2_PRIVCFGR3_PRIV67_Pos  (3U)
#define EXTI2_PRIVCFGR3_PRIV67_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV67_Pos)          /*!< 0x00000008 */
#define EXTI2_PRIVCFGR3_PRIV67      EXTI2_PRIVCFGR3_PRIV67_Msk                    /*!< SEC/PRIV enable on event input 67 */
#define EXTI2_PRIVCFGR3_PRIV68_Pos  (4U)
#define EXTI2_PRIVCFGR3_PRIV68_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV68_Pos)          /*!< 0x00000010 */
#define EXTI2_PRIVCFGR3_PRIV68      EXTI2_PRIVCFGR3_PRIV68_Msk                    /*!< SEC/PRIV enable on event input 68 */
#define EXTI2_PRIVCFGR3_PRIV69_Pos  (5U)
#define EXTI2_PRIVCFGR3_PRIV69_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV69_Pos)          /*!< 0x00000020 */
#define EXTI2_PRIVCFGR3_PRIV69      EXTI2_PRIVCFGR3_PRIV69_Msk                    /*!< SEC/PRIV enable on event input 69 */
#define EXTI2_PRIVCFGR3_PRIV70_Pos  (6U)
#define EXTI2_PRIVCFGR3_PRIV70_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV70_Pos)          /*!< 0x00000040 */
#define EXTI2_PRIVCFGR3_PRIV70      EXTI2_PRIVCFGR3_PRIV70_Msk                    /*!< SEC/PRIV enable on event input 70 */
/* no event input 71 - 75 */
#define EXTI2_PRIVCFGR3_PRIV76_Pos  (12U)
#define EXTI2_PRIVCFGR3_PRIV76_Msk  (0x1UL << EXTI2_PRIVCFGR3_PRIV76_Pos)           /*!< 0x00001000 */
#define EXTI2_PRIVCFGR3_PRIV76      EXTI2_PRIVCFGR3_PRIV76_Msk                     /*!< SEC/PRIV enable on event input 76 */
/* no event input 77 - 95 */

/*******************  Bit definition for EXTI2_CmIMR1 register  *******************/
#define EXTI2_IMR1_IM0_Pos          (0U)
#define EXTI2_IMR1_IM0_Msk          (0x1UL << EXTI2_IMR1_IM0_Pos)                 /*!< 0x00000001 */
#define EXTI2_IMR1_IM0              EXTI2_IMR1_IM0_Msk                           /*!< Interrupt Mask on line 0 */
#define EXTI2_IMR1_IM1_Pos          (1U)
#define EXTI2_IMR1_IM1_Msk          (0x1UL << EXTI2_IMR1_IM1_Pos)                 /*!< 0x00000002 */
#define EXTI2_IMR1_IM1              EXTI2_IMR1_IM1_Msk                           /*!< Interrupt Mask on line 1 */
#define EXTI2_IMR1_IM2_Pos          (2U)
#define EXTI2_IMR1_IM2_Msk          (0x1UL << EXTI2_IMR1_IM2_Pos)                 /*!< 0x00000004 */
#define EXTI2_IMR1_IM2              EXTI2_IMR1_IM2_Msk                           /*!< Interrupt Mask on line 2 */
#define EXTI2_IMR1_IM3_Pos          (3U)
#define EXTI2_IMR1_IM3_Msk          (0x1UL << EXTI2_IMR1_IM3_Pos)                 /*!< 0x00000008 */
#define EXTI2_IMR1_IM3              EXTI2_IMR1_IM3_Msk                           /*!< Interrupt Mask on line 3 */
#define EXTI2_IMR1_IM4_Pos          (4U)
#define EXTI2_IMR1_IM4_Msk          (0x1UL << EXTI2_IMR1_IM4_Pos)                 /*!< 0x00000010 */
#define EXTI2_IMR1_IM4              EXTI2_IMR1_IM4_Msk                           /*!< Interrupt Mask on line 4 */
#define EXTI2_IMR1_IM5_Pos          (5U)
#define EXTI2_IMR1_IM5_Msk          (0x1UL << EXTI2_IMR1_IM5_Pos)                 /*!< 0x00000020 */
#define EXTI2_IMR1_IM5              EXTI2_IMR1_IM5_Msk                           /*!< Interrupt Mask on line 5 */
#define EXTI2_IMR1_IM6_Pos          (6U)
#define EXTI2_IMR1_IM6_Msk          (0x1UL << EXTI2_IMR1_IM6_Pos)                 /*!< 0x00000040 */
#define EXTI2_IMR1_IM6              EXTI2_IMR1_IM6_Msk                           /*!< Interrupt Mask on line 6 */
#define EXTI2_IMR1_IM7_Pos          (7U)
#define EXTI2_IMR1_IM7_Msk          (0x1UL << EXTI2_IMR1_IM7_Pos)                 /*!< 0x00000080 */
#define EXTI2_IMR1_IM7              EXTI2_IMR1_IM7_Msk                           /*!< Interrupt Mask on line 7 */
#define EXTI2_IMR1_IM8_Pos          (8U)
#define EXTI2_IMR1_IM8_Msk          (0x1UL << EXTI2_IMR1_IM8_Pos)                 /*!< 0x00000100 */
#define EXTI2_IMR1_IM8              EXTI2_IMR1_IM8_Msk                           /*!< Interrupt Mask on line 8 */
#define EXTI2_IMR1_IM9_Pos          (9U)
#define EXTI2_IMR1_IM9_Msk          (0x1UL << EXTI2_IMR1_IM9_Pos)                 /*!< 0x00000200 */
#define EXTI2_IMR1_IM9              EXTI2_IMR1_IM9_Msk                           /*!< Interrupt Mask on line 9 */
#define EXTI2_IMR1_IM10_Pos         (10U)
#define EXTI2_IMR1_IM10_Msk         (0x1UL << EXTI2_IMR1_IM10_Pos)                /*!< 0x00000400 */
#define EXTI2_IMR1_IM10             EXTI2_IMR1_IM10_Msk                          /*!< Interrupt Mask on line 10 */
#define EXTI2_IMR1_IM11_Pos         (11U)
#define EXTI2_IMR1_IM11_Msk         (0x1UL << EXTI2_IMR1_IM11_Pos)                /*!< 0x00000800 */
#define EXTI2_IMR1_IM11             EXTI2_IMR1_IM11_Msk                          /*!< Interrupt Mask on line 11 */
#define EXTI2_IMR1_IM12_Pos         (12U)
#define EXTI2_IMR1_IM12_Msk         (0x1UL << EXTI2_IMR1_IM12_Pos)                /*!< 0x00001000 */
#define EXTI2_IMR1_IM12             EXTI2_IMR1_IM12_Msk                          /*!< Interrupt Mask on line 12 */
#define EXTI2_IMR1_IM13_Pos         (13U)
#define EXTI2_IMR1_IM13_Msk         (0x1UL << EXTI2_IMR1_IM13_Pos)                /*!< 0x00002000 */
#define EXTI2_IMR1_IM13             EXTI2_IMR1_IM13_Msk                          /*!< Interrupt Mask on line 13 */
#define EXTI2_IMR1_IM14_Pos         (14U)
#define EXTI2_IMR1_IM14_Msk         (0x1UL << EXTI2_IMR1_IM14_Pos)                /*!< 0x00004000 */
#define EXTI2_IMR1_IM14             EXTI2_IMR1_IM14_Msk                          /*!< Interrupt Mask on line 14 */
#define EXTI2_IMR1_IM15_Pos         (15U)
#define EXTI2_IMR1_IM15_Msk         (0x1UL << EXTI2_IMR1_IM15_Pos)                /*!< 0x00008000 */
#define EXTI2_IMR1_IM15             EXTI2_IMR1_IM15_Msk                          /*!< Interrupt Mask on line 15 */
#define EXTI2_IMR1_IM16_Pos         (16U)
#define EXTI2_IMR1_IM16_Msk         (0x1UL << EXTI2_IMR1_IM16_Pos)                /*!< 0x00010000 */
#define EXTI2_IMR1_IM16             EXTI2_IMR1_IM16_Msk                          /*!< Interrupt Mask on line 16 */
#define EXTI2_IMR1_IM17_Pos         (17U)
#define EXTI2_IMR1_IM17_Msk         (0x1UL << EXTI2_IMR1_IM17_Pos)                /*!< 0x00020000 */
#define EXTI2_IMR1_IM17             EXTI2_IMR1_IM17_Msk                          /*!< Interrupt Mask on line 17 */
#define EXTI2_IMR1_IM18_Pos         (18U)
#define EXTI2_IMR1_IM18_Msk         (0x1UL << EXTI2_IMR1_IM18_Pos)                /*!< 0x00040000 */
#define EXTI2_IMR1_IM18             EXTI2_IMR1_IM18_Msk                          /*!< Interrupt Mask on line 18 */
#define EXTI2_IMR1_IM19_Pos         (19U)
#define EXTI2_IMR1_IM19_Msk         (0x1UL << EXTI2_IMR1_IM19_Pos)                /*!< 0x00080000 */
#define EXTI2_IMR1_IM19             EXTI2_IMR1_IM19_Msk                          /*!< Interrupt Mask on line 19 */
#define EXTI2_IMR1_IM20_Pos         (20U)
#define EXTI2_IMR1_IM20_Msk         (0x1UL << EXTI2_IMR1_IM20_Pos)                /*!< 0x00100000 */
#define EXTI2_IMR1_IM20             EXTI2_IMR1_IM20_Msk                          /*!< Interrupt Mask on line 20 */
#define EXTI2_IMR1_IM21_Pos         (21U)
#define EXTI2_IMR1_IM21_Msk         (0x1UL << EXTI2_IMR1_IM21_Pos)                /*!< 0x00200000 */
#define EXTI2_IMR1_IM21             EXTI2_IMR1_IM21_Msk                          /*!< Interrupt Mask on line 21 */
#define EXTI2_IMR1_IM22_Pos         (22U)
#define EXTI2_IMR1_IM22_Msk         (0x1UL << EXTI2_IMR1_IM22_Pos)                /*!< 0x00400000 */
#define EXTI2_IMR1_IM22             EXTI2_IMR1_IM22_Msk                          /*!< Interrupt Mask on line 22 */
#define EXTI2_IMR1_IM23_Pos         (23U)
#define EXTI2_IMR1_IM23_Msk         (0x1UL << EXTI2_IMR1_IM23_Pos)                /*!< 0x00800000 */
#define EXTI2_IMR1_IM23             EXTI2_IMR1_IM23_Msk                          /*!< Interrupt Mask on line 23 */
#define EXTI2_IMR1_IM24_Pos         (24U)
#define EXTI2_IMR1_IM24_Msk         (0x1UL << EXTI2_IMR1_IM24_Pos)                /*!< 0x01000000 */
#define EXTI2_IMR1_IM24             EXTI2_IMR1_IM24_Msk                          /*!< Interrupt Mask on line 24 */
#define EXTI2_IMR1_IM25_Pos         (25U)
#define EXTI2_IMR1_IM25_Msk         (0x1UL << EXTI2_IMR1_IM25_Pos)                /*!< 0x02000000 */
#define EXTI2_IMR1_IM25             EXTI2_IMR1_IM25_Msk                          /*!< Interrupt Mask on line 25 */
#define EXTI2_IMR1_IM26_Pos         (26U)
#define EXTI2_IMR1_IM26_Msk         (0x1UL << EXTI2_IMR1_IM26_Pos)                /*!< 0x04000000 */
#define EXTI2_IMR1_IM26             EXTI2_IMR1_IM26_Msk                          /*!< Interrupt Mask on line 26 */
#define EXTI2_IMR1_IM27_Pos         (27U)
#define EXTI2_IMR1_IM27_Msk         (0x1UL << EXTI2_IMR1_IM27_Pos)                /*!< 0x08000000 */
#define EXTI2_IMR1_IM27             EXTI2_IMR1_IM27_Msk                          /*!< Interrupt Mask on line 27 */
/* No interrupt line 28 */
#define EXTI2_IMR1_IM29_Pos         (29U)
#define EXTI2_IMR1_IM29_Msk         (0x1UL << EXTI2_IMR1_IM29_Pos)                /*!< 0x20000000 */
#define EXTI2_IMR1_IM29             EXTI2_IMR1_IM29_Msk                          /*!< Interrupt Mask on line 29 */
#define EXTI2_IMR1_IM30_Pos         (30U)
#define EXTI2_IMR1_IM30_Msk         (0x1UL << EXTI2_IMR1_IM30_Pos)                /*!< 0x40000000 */
#define EXTI2_IMR1_IM30             EXTI2_IMR1_IM30_Msk                          /*!< Interrupt Mask on line 30 */
#define EXTI2_IMR1_IM31_Pos         (31U)
#define EXTI2_IMR1_IM31_Msk         (0x1UL << EXTI2_IMR1_IM31_Pos)                /*!< 0x80000000 */
#define EXTI2_IMR1_IM31             EXTI2_IMR1_IM31_Msk                          /*!< Interrupt Mask on line 31 */

/*******************  Bit definition for EXTI2_CmEMR1 register  *******************/
#define EXTI2_EMR1_EM0_Pos          (0U)
#define EXTI2_EMR1_EM0_Msk          (0x1UL << EXTI2_EMR1_EM0_Pos)                 /*!< 0x00000001 */
#define EXTI2_EMR1_EM0              EXTI2_EMR1_EM0_Msk                           /*!< Interrupt Mask on line 0 */
#define EXTI2_EMR1_EM1_Pos          (1U)
#define EXTI2_EMR1_EM1_Msk          (0x1UL << EXTI2_EMR1_EM1_Pos)                 /*!< 0x00000002 */
#define EXTI2_EMR1_EM1              EXTI2_EMR1_EM1_Msk                           /*!< Interrupt Mask on line 1 */
#define EXTI2_EMR1_EM2_Pos          (2U)
#define EXTI2_EMR1_EM2_Msk          (0x1UL << EXTI2_EMR1_EM2_Pos)                 /*!< 0x00000004 */
#define EXTI2_EMR1_EM2              EXTI2_EMR1_EM2_Msk                           /*!< Interrupt Mask on line 2 */
#define EXTI2_EMR1_EM3_Pos          (3U)
#define EXTI2_EMR1_EM3_Msk          (0x1UL << EXTI2_EMR1_EM3_Pos)                 /*!< 0x00000008 */
#define EXTI2_EMR1_EM3              EXTI2_EMR1_EM3_Msk                           /*!< Interrupt Mask on line 3 */
#define EXTI2_EMR1_EM4_Pos          (4U)
#define EXTI2_EMR1_EM4_Msk          (0x1UL << EXTI2_EMR1_EM4_Pos)                 /*!< 0x00000010 */
#define EXTI2_EMR1_EM4              EXTI2_EMR1_EM4_Msk                           /*!< Interrupt Mask on line 4 */
#define EXTI2_EMR1_EM5_Pos          (5U)
#define EXTI2_EMR1_EM5_Msk          (0x1UL << EXTI2_EMR1_EM5_Pos)                 /*!< 0x00000020 */
#define EXTI2_EMR1_EM5              EXTI2_EMR1_EM5_Msk                           /*!< Interrupt Mask on line 5 */
#define EXTI2_EMR1_EM6_Pos          (6U)
#define EXTI2_EMR1_EM6_Msk          (0x1UL << EXTI2_EMR1_EM6_Pos)                 /*!< 0x00000040 */
#define EXTI2_EMR1_EM6              EXTI2_EMR1_EM6_Msk                           /*!< Interrupt Mask on line 6 */
#define EXTI2_EMR1_EM7_Pos          (7U)
#define EXTI2_EMR1_EM7_Msk          (0x1UL << EXTI2_EMR1_EM7_Pos)                 /*!< 0x00000080 */
#define EXTI2_EMR1_EM7              EXTI2_EMR1_EM7_Msk                           /*!< Interrupt Mask on line 7 */
#define EXTI2_EMR1_EM8_Pos          (8U)
#define EXTI2_EMR1_EM8_Msk          (0x1UL << EXTI2_EMR1_EM8_Pos)                 /*!< 0x00000100 */
#define EXTI2_EMR1_EM8              EXTI2_EMR1_EM8_Msk                           /*!< Interrupt Mask on line 8 */
#define EXTI2_EMR1_EM9_Pos          (9U)
#define EXTI2_EMR1_EM9_Msk          (0x1UL << EXTI2_EMR1_EM9_Pos)                 /*!< 0x00000200 */
#define EXTI2_EMR1_EM9              EXTI2_EMR1_EM9_Msk                           /*!< Interrupt Mask on line 9 */
#define EXTI2_EMR1_EM10_Pos         (10U)
#define EXTI2_EMR1_EM10_Msk         (0x1UL << EXTI2_EMR1_EM10_Pos)                /*!< 0x00000400 */
#define EXTI2_EMR1_EM10             EXTI2_EMR1_EM10_Msk                          /*!< Interrupt Mask on line 10 */
#define EXTI2_EMR1_EM11_Pos         (11U)
#define EXTI2_EMR1_EM11_Msk         (0x1UL << EXTI2_EMR1_EM11_Pos)                /*!< 0x00000800 */
#define EXTI2_EMR1_EM11             EXTI2_EMR1_EM11_Msk                          /*!< Interrupt Mask on line 11 */
#define EXTI2_EMR1_EM12_Pos         (12U)
#define EXTI2_EMR1_EM12_Msk         (0x1UL << EXTI2_EMR1_EM12_Pos)                /*!< 0x00001000 */
#define EXTI2_EMR1_EM12             EXTI2_EMR1_EM12_Msk                          /*!< Interrupt Mask on line 12 */
#define EXTI2_EMR1_EM13_Pos         (13U)
#define EXTI2_EMR1_EM13_Msk         (0x1UL << EXTI2_EMR1_EM13_Pos)                /*!< 0x00002000 */
#define EXTI2_EMR1_EM13             EXTI2_EMR1_EM13_Msk                          /*!< Interrupt Mask on line 13 */
#define EXTI2_EMR1_EM14_Pos         (14U)
#define EXTI2_EMR1_EM14_Msk         (0x1UL << EXTI2_EMR1_EM14_Pos)                /*!< 0x00004000 */
#define EXTI2_EMR1_EM14             EXTI2_EMR1_EM14_Msk                          /*!< Interrupt Mask on line 14 */
#define EXTI2_EMR1_EM15_Pos         (15U)
#define EXTI2_EMR1_EM15_Msk         (0x1UL << EXTI2_EMR1_EM15_Pos)                /*!< 0x00008000 */
#define EXTI2_EMR1_EM15             EXTI2_EMR1_EM15_Msk                          /*!< Interrupt Mask on line 15 */

