STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/*****************  Bit definition for GPIO_HWCFGR7 register  *****************/
#define GPIO_HWCFGR7_AF_PRIO0_Pos      (0U)
#define GPIO_HWCFGR7_AF_PRIO0_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO0_Pos)      /*!< 0x0000000F */
#define GPIO_HWCFGR7_AF_PRIO0          GPIO_HWCFGR7_AF_PRIO0_Msk                /*!< Indicate the priority AF for I/O0 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO1_Pos      (4U)
#define GPIO_HWCFGR7_AF_PRIO1_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO1_Pos)      /*!< 0x000000F0 */
#define GPIO_HWCFGR7_AF_PRIO1          GPIO_HWCFGR7_AF_PRIO1_Msk                /*!< Indicate the priority AF for I/O1 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO2_Pos      (8U)
#define GPIO_HWCFGR7_AF_PRIO2_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO2_Pos)      /*!< 0x00000F00 */
#define GPIO_HWCFGR7_AF_PRIO2          GPIO_HWCFGR7_AF_PRIO2_Msk                /*!< Indicate the priority AF for I/O2 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO3_Pos      (12U)
#define GPIO_HWCFGR7_AF_PRIO3_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO3_Pos)      /*!< 0x0000F000 */
#define GPIO_HWCFGR7_AF_PRIO3          GPIO_HWCFGR7_AF_PRIO3_Msk                /*!< Indicate the priority AF for I/O3 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO4_Pos      (16U)
#define GPIO_HWCFGR7_AF_PRIO4_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO4_Pos)      /*!< 0x000F0000 */
#define GPIO_HWCFGR7_AF_PRIO4          GPIO_HWCFGR7_AF_PRIO4_Msk                /*!< Indicate the priority AF for I/O4 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO5_Pos      (20U)
#define GPIO_HWCFGR7_AF_PRIO5_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO5_Pos)      /*!< 0x00F00000 */
#define GPIO_HWCFGR7_AF_PRIO5          GPIO_HWCFGR7_AF_PRIO5_Msk                /*!< Indicate the priority AF for I/O5 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO6_Pos      (24U)
#define GPIO_HWCFGR7_AF_PRIO6_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO6_Pos)      /*!< 0x0F000000 */
#define GPIO_HWCFGR7_AF_PRIO6          GPIO_HWCFGR7_AF_PRIO6_Msk                /*!< Indicate the priority AF for I/O6 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO7_Pos      (28U)
#define GPIO_HWCFGR7_AF_PRIO7_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO7_Pos)      /*!< 0xF0000000 */
#define GPIO_HWCFGR7_AF_PRIO7          GPIO_HWCFGR7_AF_PRIO7_Msk                /*!< Indicate the priority AF for I/O7 (0 to F) */

/*****************  Bit definition for GPIO_HWCFGR6 register  *****************/
#define GPIO_HWCFGR6_MODER_RES_Pos     (0U)
#define GPIO_HWCFGR6_MODER_RES_Msk     (0xFFFFFFFFUL << GPIO_HWCFGR6_MODER_RES_Pos)  /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR6_MODER_RES         GPIO_HWCFGR6_MODER_RES_Msk               /*!< MODER register reset value */

/*****************  Bit definition for GPIO_HWCFGR5 register  *****************/
#define GPIO_HWCFGR5_PUPDR_RES_Pos     (0U)
#define GPIO_HWCFGR5_PUPDR_RES_Msk     (0xFFFFFFFFUL << GPIO_HWCFGR5_PUPDR_RES_Pos)  /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR5_PUPDR_RES         GPIO_HWCFGR5_PUPDR_RES_Msk               /*!< Pull-up / pull-down register reset value */

/*****************  Bit definition for GPIO_HWCFGR4 register  *****************/
#define GPIO_HWCFGR4_OSPEED_RES_Pos    (0U)
#define GPIO_HWCFGR4_OSPEED_RES_Msk    (0xFFFFFFFFUL << GPIO_HWCFGR4_OSPEED_RES_Pos)   /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR4_OSPEED_RES        GPIO_HWCFGR4_OSPEED_RES_Msk              /*!< OSPEED register reset value */

/*****************  Bit definition for GPIO_HWCFGR3 register  *****************/
#define GPIO_HWCFGR3_ODR_RES_Pos       (0U)
#define GPIO_HWCFGR3_ODR_RES_Msk       (0xFFFFUL << GPIO_HWCFGR3_ODR_RES_Pos)    /*!< 0x0000FFFF */
#define GPIO_HWCFGR3_ODR_RES           GPIO_HWCFGR3_ODR_RES_Msk                 /*!< Output data register reset value */
#define GPIO_HWCFGR3_OTYPER_RES_Pos    (16U)
#define GPIO_HWCFGR3_OTYPER_RES_Msk    (0xFFFFUL << GPIO_HWCFGR3_OTYPER_RES_Pos) /*!< 0xFFFF0000 */
#define GPIO_HWCFGR3_OTYPER_RES        GPIO_HWCFGR3_OTYPER_RES_Msk              /*!< Output type register reset value */

/*****************  Bit definition for GPIO_HWCFGR2 register  *****************/
#define GPIO_HWCFGR2_AFRL_RES_Pos      (0U)
#define GPIO_HWCFGR2_AFRL_RES_Msk      (0xFFFFFFFFUL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR2_AFRL_RES          GPIO_HWCFGR2_AFRL_RES_Msk                /*!< AF register low reset value */

/*****************  Bit definition for GPIO_HWCFGR1 register  *****************/
#define GPIO_HWCFGR1_AFRH_RES_Pos      (0U)
#define GPIO_HWCFGR1_AFRH_RES_Msk      (0xFFFFFFFFUL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR1_AFRH_RES          GPIO_HWCFGR1_AFRH_RES_Msk                /*!< AF register high reset value */

/*****************  Bit definition for GPIO_HWCFGR0 register  *****************/
#define GPIO_HWCFGR0_OR_RES_Pos        (0U)
#define GPIO_HWCFGR0_OR_RES_Msk        (0xFFFFUL << GPIO_HWCFGR0_OR_RES_Pos)     /*!< 0x0000FFFF */
#define GPIO_HWCFGR0_OR_RES            GPIO_HWCFGR0_OR_RES_Msk                  /*!< Option register reset value */

/******************  Bit definition for GPIO_VERR register  *******************/
#define GPIO_VERR_MINREV_Pos           (0U)
#define GPIO_VERR_MINREV_Msk           (0xFUL << GPIO_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define GPIO_VERR_MINREV               GPIO_VERR_MINREV_Msk                     /*!< Minor revision */
#define GPIO_VERR_MAJREV_Pos           (4U)
#define GPIO_VERR_MAJREV_Msk           (0xFUL << GPIO_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define GPIO_VERR_MAJREV               GPIO_VERR_MAJREV_Msk                     /*!< Major revision */

/******************  Bit definition for GPIO_IPIDR register  ******************/
#define GPIO_IPIDR_IPID_Pos            (0U)
#define GPIO_IPIDR_IPID_Msk            (0xFFFFFFFFUL << GPIO_IPIDR_IPID_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_IPIDR_IPID                GPIO_IPIDR_IPID_Msk                      /*!< IP identifier */

/******************  Bit definition for GPIO_SIDR register  *******************/
#define GPIO_SIDR_SID_Pos              (0U)
#define GPIO_SIDR_SID_Msk              (0xFFFFFFFFUL << GPIO_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define GPIO_SIDR_SID                  GPIO_SIDR_SID_Msk                        /*!< Size identifier */

/******************************************************************************/
/*                                                                            */
/*                                  (GICV2M)                                  */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for GICV2M_TYPER register  *****************/
#define GICV2M_TYPER_NUMBER_OF_SPIS_Pos         (0U)
#define GICV2M_TYPER_NUMBER_OF_SPIS_Msk         (0x3FFUL << GICV2M_TYPER_NUMBER_OF_SPIS_Pos)      /*!< 0x000003FF */
#define GICV2M_TYPER_NUMBER_OF_SPIS             GICV2M_TYPER_NUMBER_OF_SPIS_Msk      /*!< Returns the number-1 of contiguous SPIs assigned to the frame */
#define GICV2M_TYPER_BASE_SPI_NUMBER_Pos        (16U)
#define GICV2M_TYPER_BASE_SPI_NUMBER_Msk        (0x3FFUL << GICV2M_TYPER_BASE_SPI_NUMBER_Pos)       /*!< 0x03FF0000 */
#define GICV2M_TYPER_BASE_SPI_NUMBER            GICV2M_TYPER_BASE_SPI_NUMBER_Msk     /*!< Returns the lowest SPI ID assigned to the frame */

/****************  Bit definition for GICV2M_SETSPI register  *****************/
#define GICV2M_SETSPI_SPI_NUM_Pos               (0U)
#define GICV2M_SETSPI_SPI_NUM_Msk               (0x3FFUL << GICV2M_SETSPI_SPI_NUM_Pos)/*!< 0x000003FF */
#define GICV2M_SETSPI_SPI_NUM                   GICV2M_SETSPI_SPI_NUM_Msk            /*!< On a write, an edge-triggered interrupt is generated to the GIC for an SPI with the ID identified b */

/***************  Bit definition for GICV2M_MISC_CTRL register  ***************/
#define GICV2M_MISC_CTRL_SPI_MERGED_Pos         (1U)
#define GICV2M_MISC_CTRL_SPI_MERGED_Msk         (0x1UL << GICV2M_MISC_CTRL_SPI_MERGED_Pos)    /*!< 0x00000002 */
#define GICV2M_MISC_CTRL_SPI_MERGED             GICV2M_MISC_CTRL_SPI_MERGED_Msk      /*!<  */

