STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/*****************  Bit definition for LVDS_PSBCR2 register  ******************/
#define LVDS_PSBCR2_SLV_BIAS_TRIM_Pos                          (0U)
#define LVDS_PSBCR2_SLV_BIAS_TRIM_Msk                          (0x7FFFUL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                       /*!< 0x00007FFF */
#define LVDS_PSBCR2_SLV_BIAS_TRIM                              LVDS_PSBCR2_SLV_BIAS_TRIM_Msk                                    /*!< 0x0: 27.71uA */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_0                            (0x1UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                          /*!< 0x00000001 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_1                            (0x2UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                          /*!< 0x00000002 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_2                            (0x4UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                          /*!< 0x00000004 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_3                            (0x8UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                          /*!< 0x00000008 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_4                            (0x10UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                         /*!< 0x00000010 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_5                            (0x20UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                         /*!< 0x00000020 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_6                            (0x40UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                         /*!< 0x00000040 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_7                            (0x80UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                         /*!< 0x00000080 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_8                            (0x100UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                        /*!< 0x00000100 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_9                            (0x200UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                        /*!< 0x00000200 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_10                           (0x400UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                        /*!< 0x00000400 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_11                           (0x800UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                        /*!< 0x00000800 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_12                           (0x1000UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                       /*!< 0x00001000 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_13                           (0x2000UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                       /*!< 0x00002000 */
#define LVDS_PSBCR2_SLV_BIAS_TRIM_14                           (0x4000UL << LVDS_PSBCR2_SLV_BIAS_TRIM_Pos)                       /*!< 0x00004000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos                      (16U)
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Msk                      (0xFFFUL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                    /*!< 0x0FFF0000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM                          LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Msk                                /*!< 0x1: 0.3961V 27.01 uA */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_0                        (0x1UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                  /*!< 0x00010000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_1                        (0x2UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                  /*!< 0x00020000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_2                        (0x4UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                  /*!< 0x00040000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_3                        (0x8UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                  /*!< 0x00080000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_4                        (0x10UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                 /*!< 0x00100000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_5                        (0x20UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                 /*!< 0x00200000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_6                        (0x40UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                 /*!< 0x00400000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_7                        (0x80UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                 /*!< 0x00800000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_8                        (0x100UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                /*!< 0x01000000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_9                        (0x200UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                /*!< 0x02000000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_10                       (0x400UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                /*!< 0x04000000 */
#define LVDS_PSBCR2_SLV_BIAS_VREFTRIM_11                       (0x800UL << LVDS_PSBCR2_SLV_BIAS_VREFTRIM_Pos)                /*!< 0x08000000 */
#define LVDS_PSBCR2_SLV_BIAS_EN_Pos                            (28U)
#define LVDS_PSBCR2_SLV_BIAS_EN_Msk                            (0x1UL << LVDS_PSBCR2_SLV_BIAS_EN_Pos)                            /*!< 0x10000000 */
#define LVDS_PSBCR2_SLV_BIAS_EN                                LVDS_PSBCR2_SLV_BIAS_EN_Msk                                      /*!< lvds macro global bias enable */
#define LVDS_PSBCR2_SLV_BIAS_VREF_SEL_Pos                      (29U)
#define LVDS_PSBCR2_SLV_BIAS_VREF_SEL_Msk                      (0x1UL << LVDS_PSBCR2_SLV_BIAS_VREF_SEL_Pos)                      /*!< 0x20000000 */
#define LVDS_PSBCR2_SLV_BIAS_VREF_SEL                          LVDS_PSBCR2_SLV_BIAS_VREF_SEL_Msk                                /*!< Selection for current generation internal reference */

/*****************  Bit definition for LVDS_PSBCR3 register  ******************/
#define LVDS_PSBCR3_SLV_VM_EN_DL0_Pos                          (0U)
#define LVDS_PSBCR3_SLV_VM_EN_DL0_Msk                          (0x1UL << LVDS_PSBCR3_SLV_VM_EN_DL0_Pos)                          /*!< 0x00000001 */
#define LVDS_PSBCR3_SLV_VM_EN_DL0                              LVDS_PSBCR3_SLV_VM_EN_DL0_Msk                                    /*!< Enable the voltage mode driver for data lane0 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL0_Pos                  (1U)
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL0_Msk                  (0x1UL << LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL0_Pos)                  /*!< 0x00000002 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL0                      LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL0_Msk                            /*!< Bias booster for the voltage mode driver LDOS, data lane0 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL0_Pos                 (2U)
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL0_Msk                 (0x1UL << LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL0_Pos)                 /*!< 0x00000004 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL0                     LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL0_Msk                           /*!< Sets the voltage mode driver to use a reference derived from the power supply, data lane0 */
#define LVDS_PSBCR3_SLV_VM_EN_DL1_Pos                          (4U)
#define LVDS_PSBCR3_SLV_VM_EN_DL1_Msk                          (0x1UL << LVDS_PSBCR3_SLV_VM_EN_DL1_Pos)                          /*!< 0x00000010 */
#define LVDS_PSBCR3_SLV_VM_EN_DL1                              LVDS_PSBCR3_SLV_VM_EN_DL1_Msk                                    /*!< Enable the voltage mode driver for data lane1 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL1_Pos                  (5U)
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL1_Msk                  (0x1UL << LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL1_Pos)                  /*!< 0x00000020 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL1                      LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL1_Msk                            /*!< Bias booster for the voltage mode driver LDOS, data lane1 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL1_Pos                 (6U)
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL1_Msk                 (0x1UL << LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL1_Pos)                 /*!< 0x00000040 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL1                     LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL1_Msk                           /*!< Sets the voltage mode driver to use a reference derived from the power supply, data lane1 */
#define LVDS_PSBCR3_SLV_VM_EN_DL2_Pos                          (8U)
#define LVDS_PSBCR3_SLV_VM_EN_DL2_Msk                          (0x1UL << LVDS_PSBCR3_SLV_VM_EN_DL2_Pos)                          /*!< 0x00000100 */
#define LVDS_PSBCR3_SLV_VM_EN_DL2                              LVDS_PSBCR3_SLV_VM_EN_DL2_Msk                                    /*!< Enable the voltage mode driver for data lane2 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL2_Pos                  (9U)
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL2_Msk                  (0x1UL << LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL2_Pos)                  /*!< 0x00000200 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL2                      LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL2_Msk                            /*!< Bias booster for the voltage mode driver LDOS, data lane2 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL2_Pos                 (10U)
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL2_Msk                 (0x1UL << LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL2_Pos)                 /*!< 0x00000400 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL2                     LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL2_Msk                           /*!< Sets the voltage mode driver to use a reference derived from the power supply, data lane2 */
#define LVDS_PSBCR3_SLV_VM_EN_DL3_Pos                          (12U)
#define LVDS_PSBCR3_SLV_VM_EN_DL3_Msk                          (0x1UL << LVDS_PSBCR3_SLV_VM_EN_DL3_Pos)                          /*!< 0x00001000 */
#define LVDS_PSBCR3_SLV_VM_EN_DL3                              LVDS_PSBCR3_SLV_VM_EN_DL3_Msk                                    /*!< Enable the voltage mode driver for data lane3 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL3_Pos                  (13U)
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL3_Msk                  (0x1UL << LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL3_Pos)                  /*!< 0x00002000 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL3                      LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL3_Msk                            /*!< Bias booster for the voltage mode driver LDOS, data lane3 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL3_Pos                 (14U)
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL3_Msk                 (0x1UL << LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL3_Pos)                 /*!< 0x00004000 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL3                     LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL3_Msk                           /*!< Sets the voltage mode driver to use a reference derived from the power supply, data lane3 */
#define LVDS_PSBCR3_SLV_VM_EN_DL4_Pos                          (16U)
#define LVDS_PSBCR3_SLV_VM_EN_DL4_Msk                          (0x1UL << LVDS_PSBCR3_SLV_VM_EN_DL4_Pos)                          /*!< 0x00010000 */
#define LVDS_PSBCR3_SLV_VM_EN_DL4                              LVDS_PSBCR3_SLV_VM_EN_DL4_Msk                                    /*!< Enable the voltage mode driver for data lane4 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL4_Pos                  (17U)
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL4_Msk                  (0x1UL << LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL4_Pos)                  /*!< 0x00020000 */
#define LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL4                      LVDS_PSBCR3_SLV_VM_BOOST_BIAS_DL4_Msk                            /*!< Bias booster for the voltage mode driver LDOS, data lane4 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL4_Pos                 (18U)
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL4_Msk                 (0x1UL << LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL4_Pos)                 /*!< 0x00040000 */
#define LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL4                     LVDS_PSBCR3_SLV_VM_USE_VDD_REF_DL4_Msk                           /*!< Sets the voltage mode driver to use a reference derived from the power supply, data lane4 */

/*****************  Bit definition for LVDS_PSBCR4 register  ******************/
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Pos               (0U)
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Msk               (0xFUL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Pos)               /*!< 0x0000000F */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0                   LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Msk                         /*!< Fine tuning for the voltage mode driver VOH, data lane0 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_0                 (0x1UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Pos)               /*!< 0x00000001 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_1                 (0x2UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Pos)               /*!< 0x00000002 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_2                 (0x4UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Pos)               /*!< 0x00000004 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_3                 (0x8UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL0_Pos)               /*!< 0x00000008 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Pos               (4U)
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Msk               (0xFUL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Pos)               /*!< 0x000000F0 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1                   LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Msk                         /*!< Fine tuning for the voltage mode driver VOH, data lane1 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_0                 (0x1UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Pos)              /*!< 0x00000010 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_1                 (0x2UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Pos)              /*!< 0x00000020 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_2                 (0x4UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Pos)              /*!< 0x00000040 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_3                 (0x8UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL1_Pos)              /*!< 0x00000080 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Pos               (8U)
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Msk               (0xFUL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Pos)               /*!< 0x00000F00 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2                   LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Msk                         /*!< Fine tuning for the voltage mode driver VOH, data lane2 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_0                 (0x1UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Pos)             /*!< 0x00000100 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_1                 (0x2UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Pos)             /*!< 0x00000200 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_2                 (0x4UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Pos)             /*!< 0x00000400 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_3                 (0x8UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL2_Pos)             /*!< 0x00000800 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Pos               (12U)
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Msk               (0xFUL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Pos)               /*!< 0x0000F000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3                   LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Msk                         /*!< Fine tuning for the voltage mode driver VOH, data lane3 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_0                 (0x1UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Pos)            /*!< 0x00001000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_1                 (0x2UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Pos)            /*!< 0x00002000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_2                 (0x4UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Pos)            /*!< 0x00004000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_3                 (0x8UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL3_Pos)            /*!< 0x00008000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Pos               (16U)
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Msk               (0xFUL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Pos)               /*!< 0x000F0000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4                   LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Msk                         /*!< Fine tuning for the voltage mode driver VOH, data lane4 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_0                 (0x1UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Pos)           /*!< 0x00010000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_1                 (0x2UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Pos)           /*!< 0x00020000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_2                 (0x4UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Pos)           /*!< 0x00040000 */
#define LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_3                 (0x8UL << LVDS_PSBCR4_SLV_VM_VOUT_VOH_CTRL_DL4_Pos)           /*!< 0x00080000 */

/*****************  Bit definition for LVDS_PSBCR5 register  ******************/
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Pos               (0U)
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Msk               (0xFUL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Pos)               /*!< 0x0000000F */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0                   LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Msk                         /*!< Fine tuning for the voltage mode driver VOL, data lane0 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_0                 (0x1UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Pos)               /*!< 0x00000001 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_1                 (0x2UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Pos)               /*!< 0x00000002 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_2                 (0x4UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Pos)               /*!< 0x00000004 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_3                 (0x8UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL0_Pos)               /*!< 0x00000008 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Pos               (4U)
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Msk               (0xFUL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Pos)               /*!< 0x000000F0 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1                   LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Msk                         /*!< Fine tuning for the voltage mode driver VOL, data lane1 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_0                 (0x1UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Pos)              /*!< 0x00000010 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_1                 (0x2UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Pos)              /*!< 0x00000020 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_2                 (0x4UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Pos)              /*!< 0x00000040 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_3                 (0x8UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL1_Pos)              /*!< 0x00000080 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Pos               (8U)
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Msk               (0xFUL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Pos)               /*!< 0x00000F00 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2                   LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Msk                         /*!< Fine tuning for the voltage mode driver VOL, data lane2 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_0                 (0x1UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Pos)             /*!< 0x00000100 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_1                 (0x2UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Pos)             /*!< 0x00000200 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_2                 (0x4UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Pos)             /*!< 0x00000400 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_3                 (0x8UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL2_Pos)             /*!< 0x00000800 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Pos               (12U)
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Msk               (0xFUL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Pos)               /*!< 0x0000F000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3                   LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Msk                         /*!< Fine tuning for the voltage mode driver VOL, data lane3 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_0                 (0x1UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Pos)            /*!< 0x00001000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_1                 (0x2UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Pos)            /*!< 0x00002000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_2                 (0x4UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Pos)            /*!< 0x00004000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_3                 (0x8UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL3_Pos)            /*!< 0x00008000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Pos               (16U)
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Msk               (0xFUL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Pos)               /*!< 0x000F0000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4                   LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Msk                         /*!< Fine tuning for the voltage mode driver VOL, data lane4 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_0                 (0x1UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Pos)           /*!< 0x00010000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_1                 (0x2UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Pos)           /*!< 0x00020000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_2                 (0x4UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Pos)           /*!< 0x00040000 */
#define LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_3                 (0x8UL << LVDS_PSBCR5_SLV_VM_VOUT_VOL_CTRL_DL4_Pos)           /*!< 0x00080000 */

