STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/*****************  Bit definition for LVDS_PSPLLSR register  *****************/
#define LVDS_PSPLLSR_SLV_PLL_LOCK_Pos                          (0U)
#define LVDS_PSPLLSR_SLV_PLL_LOCK_Msk                          (0x1UL << LVDS_PSPLLSR_SLV_PLL_LOCK_Pos)                          /*!< 0x00000001 */
#define LVDS_PSPLLSR_SLV_PLL_LOCK                              LVDS_PSPLLSR_SLV_PLL_LOCK_Msk                                    /*!< PLL lock During a certain number of cycles of reference clock, pll_lock is asserted high and then goes low waiting for the LVDS-PHY PLL t0 lock */
#define LVDS_PSPLLSR_SLV_PLL_REF_OK_Pos                        (4U)
#define LVDS_PSPLLSR_SLV_PLL_REF_OK_Msk                        (0x1UL << LVDS_PSPLLSR_SLV_PLL_REF_OK_Pos)                        /*!< 0x00000010 */
#define LVDS_PSPLLSR_SLV_PLL_REF_OK                            LVDS_PSPLLSR_SLV_PLL_REF_OK_Msk                                  /*!< PLL reference ok */
#define LVDS_PSPLLSR_SLV_PLL_LDO_OK_Pos                        (8U)
#define LVDS_PSPLLSR_SLV_PLL_LDO_OK_Msk                        (0x1UL << LVDS_PSPLLSR_SLV_PLL_LDO_OK_Pos)                        /*!< 0x00000100 */
#define LVDS_PSPLLSR_SLV_PLL_LDO_OK                            LVDS_PSPLLSR_SLV_PLL_LDO_OK_Msk                                  /*!< PLL LDO ok */

/***************  Bit definition for LVDS_PSPLLSDCR1 register  ****************/
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos               (0U)
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Msk               (0x3FFUL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)             /*!< 0x000003FF */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO                   LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Msk                         /*!< Integer Setting of PLL Feedback Clock Divider (MDIV, divides VCO clock for feedback). */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_0                 (0x1UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000001 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_1                 (0x2UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000002 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_2                 (0x4UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000004 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_3                 (0x8UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000008 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_4                 (0x10UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000010 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_5                 (0x20UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000020 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_6                 (0x40UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000040 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_7                 (0x80UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000080 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_8                 (0x100UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)             /*!< 0x00000100 */
#define LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_9                 (0x200UL << LVDS_PSPLLSDCR1_SLV_PLL_SD_INT_RATIO_Pos)             /*!< 0x00000200 */

/***************  Bit definition for LVDS_PSPLLSDCR2 register  ****************/
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos       (0U)
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Msk       (0x7FFFFFUL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x007FFFFF */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS           LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Msk                 /*!< Fractional Setting of PLL Feedback Clock Divider (MDIV, divides VCO clock for feedback) */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_0         (0x1UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000001 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_1         (0x2UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000002 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_2         (0x4UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000004 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_3         (0x8UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000008 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_4         (0x10UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000010 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_5         (0x20UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000020 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_6         (0x40UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000040 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_7         (0x80UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000080 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_8         (0x100UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000100 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_9         (0x200UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000200 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_10        (0x400UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000400 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_11        (0x800UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000800 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_12        (0x1000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00001000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_13        (0x2000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00002000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_14        (0x4000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00004000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_15        (0x8000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00008000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_16        (0x10000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00010000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_17        (0x20000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00020000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_18        (0x40000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00040000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_19        (0x80000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00080000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_20        (0x100000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x00100000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_21        (0x200000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x00200000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_22        (0x400000UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x00400000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_Pos          (24U)
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_Msk          (0x3UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_Pos)          /*!< 0x03000000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX              LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_Msk                    /*!< Bypass control for the PLL sigma delta VCO mux */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_0            (0x1UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_Pos)    /*!< 0x01000000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_1            (0x2UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_VCO_MUX_Pos)    /*!< 0x02000000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_FB_CLK_Pos           (26U)
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_FB_CLK_Msk           (0x1UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_FB_CLK_Pos)           /*!< 0x04000000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_FB_CLK               LVDS_PSPLLSDCR2_SLV_PLL_SD_BYPASS_FB_CLK_Msk                     /*!< Bypass start SD feedback clock. */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_CLK_EDGE_CNTRL_Pos          (28U)
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_CLK_EDGE_CNTRL_Msk          (0x1UL << LVDS_PSPLLSDCR2_SLV_PLL_SD_CLK_EDGE_CNTRL_Pos)          /*!< 0x10000000 */
#define LVDS_PSPLLSDCR2_SLV_PLL_SD_CLK_EDGE_CNTRL              LVDS_PSPLLSDCR2_SLV_PLL_SD_CLK_EDGE_CNTRL_Msk                    /*!< Sigma Delta Edge Control. */

/***************  Bit definition for LVDS_PSPLLTWGCR1 register  ***************/
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos                  (0U)
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Msk                  (0xFFFFFUL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)              /*!< 0x000FFFFF */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP                      LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Msk                            /*!< MDIV divdier used in integer N and Fractional N PLL modes */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_0                    (0x1UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                  /*!< 0x00000001 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_1                    (0x2UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                  /*!< 0x00000002 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_2                    (0x4UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                  /*!< 0x00000004 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_3                    (0x8UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                  /*!< 0x00000008 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_4                    (0x10UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                 /*!< 0x00000010 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_5                    (0x20UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                 /*!< 0x00000020 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_6                    (0x40UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                 /*!< 0x00000040 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_7                    (0x80UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                 /*!< 0x00000080 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_8                    (0x100UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                /*!< 0x00000100 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_9                    (0x200UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                /*!< 0x00000200 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_10                   (0x400UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                /*!< 0x00000400 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_11                   (0x800UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)                /*!< 0x00000800 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_12                   (0x1000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)               /*!< 0x00001000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_13                   (0x2000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)               /*!< 0x00002000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_14                   (0x4000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)               /*!< 0x00004000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_15                   (0x8000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)               /*!< 0x00008000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_16                   (0x10000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)              /*!< 0x00010000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_17                   (0x20000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)              /*!< 0x00020000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_18                   (0x40000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)              /*!< 0x00040000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_19                   (0x80000UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_STEP_Pos)              /*!< 0x00080000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_DOWN_SPREAD_Pos           (20U)
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_DOWN_SPREAD_Msk           (0x1UL << LVDS_PSPLLTWGCR1_SLV_PLL_TWG_DOWN_SPREAD_Pos)           /*!< 0x00100000 */
#define LVDS_PSPLLTWGCR1_SLV_PLL_TWG_DOWN_SPREAD               LVDS_PSPLLTWGCR1_SLV_PLL_TWG_DOWN_SPREAD_Msk                     /*!< TWG pattern spreading */

