STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/* Bit fields for PWR_RPRIVCFGR register */
#define PWR_RPRIVCFGR_RPRIV0_Pos               (0U)
#define PWR_RPRIVCFGR_RPRIV0_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV0_Pos)
#define PWR_RPRIVCFGR_RPRIV0                   PWR_RPRIVCFGR_RPRIV0_Msk  /*!< Privileged attribute reference for the local resource number x (x = 0)These bits are written by software to enabled the privileged mode for the local resource x.- 0: The local resource number x is unprivileged. Secure access is also possible.- 1: The local resource number x is privileged only.This bit can only be written by privileged application. If corresponding SECx bit is set in PWR_RSECCFGR this bit can only be written by secure privileged application.If compartment filtering for this local resource is enabled by setting CFEN bit in PWR_RxCIDCFGR, only an allowed compartment can write this bit, on top of secure and privileged restriction. */
#define PWR_RPRIVCFGR_RPRIV1_Pos               (1U)
#define PWR_RPRIVCFGR_RPRIV1_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV1_Pos)
#define PWR_RPRIVCFGR_RPRIV1                   PWR_RPRIVCFGR_RPRIV1_Msk  /*!< Privileged attribute reference for the local resource number x (x = 1)See RPRIV0 for details. */
#define PWR_RPRIVCFGR_RPRIV2_Pos               (2U)
#define PWR_RPRIVCFGR_RPRIV2_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV2_Pos)
#define PWR_RPRIVCFGR_RPRIV2                   PWR_RPRIVCFGR_RPRIV2_Msk  /*!< Privileged attribute reference for the local resource number x (x = 2)See RPRIV0 for details. */
#define PWR_RPRIVCFGR_RPRIV3_Pos               (3U)
#define PWR_RPRIVCFGR_RPRIV3_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV3_Pos)
#define PWR_RPRIVCFGR_RPRIV3                   PWR_RPRIVCFGR_RPRIV3_Msk  /*!< Privileged attribute reference for the local resource number x (x = 3)See RPRIV0 for details. */
#define PWR_RPRIVCFGR_RPRIV4_Pos               (4U)
#define PWR_RPRIVCFGR_RPRIV4_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV4_Pos)
#define PWR_RPRIVCFGR_RPRIV4                   PWR_RPRIVCFGR_RPRIV4_Msk  /*!< Privileged attribute reference for the local resource number x (x = 4)See RPRIV0 for details. */
#define PWR_RPRIVCFGR_RPRIV5_Pos               (5U)
#define PWR_RPRIVCFGR_RPRIV5_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV5_Pos)
#define PWR_RPRIVCFGR_RPRIV5                   PWR_RPRIVCFGR_RPRIV4_Msk  /*!< Privileged attribute reference for the local resource number x (x = 5)See RPRIV0 for details. */
#define PWR_RPRIVCFGR_RPRIV6_Pos               (6U)
#define PWR_RPRIVCFGR_RPRIV6_Msk               (0x1UL << PWR_RPRIVCFGR_RPRIV6_Pos)
#define PWR_RPRIVCFGR_RPRIV6                   PWR_RPRIVCFGR_RPRIV4_Msk  /*!< Privileged attribute reference for the local resource number x (x = 6)See RPRIV0 for details. */

/* Bit fields for PWR_R0CIDCFGR register */
#define PWR_R0CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R0CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R0CIDCFGR_CFEN_Pos)
#define PWR_R0CIDCFGR_CFEN                     PWR_R0CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R0CIDCFGR_SCID_Pos                 (4U)
#define PWR_R0CIDCFGR_SCID_Msk                 (0x7UL << PWR_R0CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R0CIDCFGR_SCID                     PWR_R0CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */
										       
/* Bit fields for PWR_R1CIDCFGR register */
#define PWR_R1CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R1CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R1CIDCFGR_CFEN_Pos)
#define PWR_R1CIDCFGR_CFEN                     PWR_R1CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R1CIDCFGR_SCID_Pos                 (4U)
#define PWR_R1CIDCFGR_SCID_Msk                 (0x7UL << PWR_R1CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R1CIDCFGR_SCID                     PWR_R1CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */

/* Bit fields for PWR_R2CIDCFGR register */
#define PWR_R2CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R2CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R2CIDCFGR_CFEN_Pos)
#define PWR_R2CIDCFGR_CFEN                     PWR_R2CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R2CIDCFGR_SCID_Pos                 (4U)
#define PWR_R2CIDCFGR_SCID_Msk                 (0x7UL << PWR_R2CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R2CIDCFGR_SCID                     PWR_R2CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */

/* Bit fields for PWR_R3CIDCFGR register */
#define PWR_R3CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R3CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R3CIDCFGR_CFEN_Pos)
#define PWR_R3CIDCFGR_CFEN                     PWR_R3CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R3CIDCFGR_SCID_Pos                 (4U)
#define PWR_R3CIDCFGR_SCID_Msk                 (0x7UL << PWR_R3CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R3CIDCFGR_SCID                     PWR_R3CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */

/* Bit fields for PWR_R4CIDCFGR register */
#define PWR_R4CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R4CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R4CIDCFGR_CFEN_Pos)
#define PWR_R4CIDCFGR_CFEN                     PWR_R4CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R4CIDCFGR_SCID_Pos                 (4U)
#define PWR_R4CIDCFGR_SCID_Msk                 (0x7UL << PWR_R4CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R4CIDCFGR_SCID                     PWR_R4CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */

/* Bit fields for PWR_R5CIDCFGR register */
#define PWR_R5CIDCFGR_CFEN_Pos                 (0U)
#define PWR_R5CIDCFGR_CFEN_Msk                 (0x1UL << PWR_R5CIDCFGR_CFEN_Pos)
#define PWR_R5CIDCFGR_CFEN                     PWR_R5CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for resource number x.- 1: Compartment-based filtering is enabled for resource number x. */
#define PWR_R5CIDCFGR_SCID_Pos                 (4U)
#define PWR_R5CIDCFGR_SCID_Msk                 (0x7UL << PWR_R5CIDCFGR_SCID_Pos)             /*!< 0x00000070 */
#define PWR_R5CIDCFGR_SCID                     PWR_R5CIDCFGR_SCID_Msk                       /*!< Static compartment identifier */

