STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/*******************  Bits definition for RISAF_REGx_zCFGR register ***********/
#define RISAF_REGZCFGR_SREN_Pos       (0U)
#define RISAF_REGZCFGR_SREN_Msk       (0x1UL << RISAF_REGZCFGR_SREN_Pos)         /*!< 0x00000001 */
#define RISAF_REGZCFGR_SREN           RISAF_REGZCFGR_SREN_Msk

#define RISAF_REGZCFGR_RLOCK_Pos      (1U)
#define RISAF_REGZCFGR_RLOCK_Msk      (0x1UL << RISAF_REGZCFGR_RLOCK_Pos)        /*!< 0x00000002 */
#define RISAF_REGZCFGR_RLOCK          RISAF_REGZCFGR_RLOCK_Msk

#define RISAF_REGZCFGR_SRCID_Pos      (4U)
#define RISAF_REGZCFGR_SRCID_Msk      (0x7UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000070 */
#define RISAF_REGZCFGR_SRCID          RISAF_REGZCFGR_SRCID_Msk
#define RISAF_REGZCFGR_SRCID0         (0x0UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000000 */
#define RISAF_REGZCFGR_SRCID1         (0x1UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000010 */
#define RISAF_REGZCFGR_SRCID2         (0x2UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000020 */
#define RISAF_REGZCFGR_SRCID3         (0x3UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000030 */
#define RISAF_REGZCFGR_SRCID4         (0x4UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000040 */
#define RISAF_REGZCFGR_SRCID5         (0x5UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000050 */
#define RISAF_REGZCFGR_SRCID6         (0x6UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000060 */
#define RISAF_REGZCFGR_SRCID7         (0x7UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000070 */

#define RISAF_REGZCFGR_SEC_Pos        (8U)
#define RISAF_REGZCFGR_SEC_Msk        (0x1UL << RISAF_REGZCFGR_SEC_Pos)          /*!< 0x00000100 */
#define RISAF_REGZCFGR_SEC            RISAF_REGZCFGR_SEC_Msk

#define RISAF_REGZCFGR_PRIV_Pos       (9U)
#define RISAF_REGZCFGR_PRIV_Msk       (0x1UL << RISAF_REGZCFGR_PRIV_Pos)         /*!< 0x00000200 */
#define RISAF_REGZCFGR_PRIV           RISAF_REGZCFGR_PRIV_Msk

#define RISAF_REGZCFGR_RDEN_Pos       (12U)
#define RISAF_REGZCFGR_RDEN_Msk       (0x1UL << RISAF_REGZCFGR_RDEN_Pos)         /*!< 0x00001000 */
#define RISAF_REGZCFGR_RDEN           RISAF_REGZCFGR_RDEN_Msk

#define RISAF_REGZCFGR_WREN_Pos       (13U)
#define RISAF_REGZCFGR_WREN_Msk       (0x1UL << RISAF_REGZCFGR_WREN_Pos)         /*!< 0x00002000 */
#define RISAF_REGZCFGR_WREN           RISAF_REGZCFGR_WREN_Msk

#define RISAF_REGZCFGR_ENC_Pos        (15U)
#define RISAF_REGZCFGR_ENC_Msk        (0x1UL << RISAF_REGZCFGR_ENC_Pos)          /*!< 0x00008000 */
#define RISAF_REGZCFGR_ENC            RISAF_REGZCFGR_ENC_Msk

/*******************  Bits definition for RISAF_REGx_zSTARTR register *********/
#define RISAF_REGZSTARTR_SADDSTART_Pos (0U)
#define RISAF_REGZSTARTR_SADDSTART_Msk (0xFFFFFFFFUL << RISAF_REGZSTARTR_SADDSTART_Pos) /*!< 0xFFFFFFFF */
#define RISAF_REGZSTARTR_SADDSTART     RISAF_REGZSTARTR_SADDSTART_Msk

/*******************  Bits definition for RISAF_REGx_zENDR register ***********/
#define RISAF_REGZENDR_SADDEND_Pos    (0U)
#define RISAF_REGZENDR_SADDEND_Msk    (0xFFFFFFFFUL << RISAF_REGZENDR_SADDEND_Pos) /*!< 0xFFFFFFFF */
#define RISAF_REGZENDR_SADDEND        RISAF_REGZENDR_SADDEND_Msk

/*******************  Bits definition for RISAF_REGx_zNESTR register **********/
#define RISAF_REGZNESTR_DCEN_Pos      (2U)
#define RISAF_REGZNESTR_DCEN_Msk      (0x1UL << RISAF_REGZNESTR_DCEN_Pos)        /*!< 0x00000004 */
#define RISAF_REGZNESTR_DCEN          RISAF_REGZNESTR_DCEN_Msk

#define RISAF_REGZNESTR_DCCID_Pos     (4U)
#define RISAF_REGZNESTR_DCCID_Msk     (0x7UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000070 */
#define RISAF_REGZNESTR_DCCID         RISAF_REGZNESTR_DCCID_Msk
#define RISAF_REGZNESTR_DCCID0        (0x0UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000000 */
#define RISAF_REGZNESTR_DCCID1        (0x1UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000010 */
#define RISAF_REGZNESTR_DCCID2        (0x2UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000020 */
#define RISAF_REGZNESTR_DCCID3        (0x3UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000030 */
#define RISAF_REGZNESTR_DCCID4        (0x4UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000040 */
#define RISAF_REGZNESTR_DCCID5        (0x5UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000050 */
#define RISAF_REGZNESTR_DCCID6        (0x6UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000060 */
#define RISAF_REGZNESTR_DCCID7        (0x7UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000070 */

/*******************  Bits definition for RISAF_HWCFGR register *****************/
#define RISAF_HWCFGR_CFG1_Pos         (0U)
#define RISAF_HWCFGR_CFG1_Msk         (0xFFUL << RISAF_HWCFGR_CFG1_Pos)          /*!< 0x000000FF */
#define RISAF_HWCFGR_CFG1             RISAF_HWCFGR_CFG1_Msk
#define RISAF_HWCFGR_CFG2_Pos         (8U)
#define RISAF_HWCFGR_CFG2_Msk         (0xFFUL << RISAF_HWCFGR_CFG2_Pos)          /*!< 0x0000FF00 */
#define RISAF_HWCFGR_CFG2             RISAF_HWCFGR_CFG2_Msk
#define RISAF_HWCFGR_CFG3_Pos         (16U)
#define RISAF_HWCFGR_CFG3_Msk         (0xFFUL << RISAF_HWCFGR_CFG3_Pos)          /*!< 0x00FF0000 */
#define RISAF_HWCFGR_CFG3             RISAF_HWCFGR_CFG3_Msk
#define RISAF_HWCFGR_CFG4_Pos         (24U)
#define RISAF_HWCFGR_CFG4_Msk         (0xFFUL << RISAF_HWCFGR_CFG4_Pos)          /*!< 0xFF000000 */
#define RISAF_HWCFGR_CFG4             RISAF_HWCFGR_CFG4_Msk

/*******************  Bits definition for RISAF_VERR register *****************/
#define RISAF_VERR_MINREV_Pos         (0U)
#define RISAF_VERR_MINREV_Msk         (0xFUL << RISAF_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define RISAF_VERR_MINREV             RISAF_VERR_MINREV_Msk

#define RISAF_VERR_MAJREV_Pos         (4U)
#define RISAF_VERR_MAJREV_Msk         (0xFUL << RISAF_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define RISAF_VERR_MAJREV             RISAF_VERR_MAJREV_Msk

/*******************  Bits definition for RISAF_IPIDR register ****************/
#define RISAF_IPIDR_ID_Pos            (0U)
#define RISAF_IPIDR_ID_Msk            (0xFFFFFFFFUL << RISAF_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define RISAF_IPIDR_ID                RISAF_IPIDR_ID_Msk

/*******************  Bits definition for RISAF_SIDR register *****************/
#define RISAF_SIDR_SID_Pos            (0U)
#define RISAF_SIDR_SID_Msk            (0xFFFFFFFFUL << RISAF_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define RISAF_SIDR_SID                RISAF_SIDR_SID_Msk

/*******************  Bits definition for IAC_IER0 register *******************/
#define IAC_IER0_IAIE0_Pos            (0U)
#define IAC_IER0_IAIE0_Msk            (0x1UL << IAC_IER0_IAIE0_Pos)              /*!< 0x00000001 */
#define IAC_IER0_IAIE0                IAC_IER0_IAIE0_Msk
#define IAC_IER0_IAIE1_Pos            (1U)
#define IAC_IER0_IAIE1_Msk            (0x1UL << IAC_IER0_IAIE1_Pos)              /*!< 0x00000002 */
#define IAC_IER0_IAIE1                IAC_IER0_IAIE1_Msk
#define IAC_IER0_IAIE2_Pos            (2U)
#define IAC_IER0_IAIE2_Msk            (0x1UL << IAC_IER0_IAIE2_Pos)              /*!< 0x00000004 */
#define IAC_IER0_IAIE2                IAC_IER0_IAIE2_Msk
#define IAC_IER0_IAIE3_Pos            (3U)
#define IAC_IER0_IAIE3_Msk            (0x1UL << IAC_IER0_IAIE3_Pos)              /*!< 0x00000008 */
#define IAC_IER0_IAIE3                IAC_IER0_IAIE3_Msk
#define IAC_IER0_IAIE4_Pos            (4U)
#define IAC_IER0_IAIE4_Msk            (0x1UL << IAC_IER0_IAIE4_Pos)              /*!< 0x00000010 */
#define IAC_IER0_IAIE4                IAC_IER0_IAIE4_Msk
#define IAC_IER0_IAIE5_Pos            (5U)
#define IAC_IER0_IAIE5_Msk            (0x1UL << IAC_IER0_IAIE5_Pos)              /*!< 0x00000020 */
#define IAC_IER0_IAIE5                IAC_IER0_IAIE5_Msk
#define IAC_IER0_IAIE6_Pos            (6U)
#define IAC_IER0_IAIE6_Msk            (0x1UL << IAC_IER0_IAIE6_Pos)              /*!< 0x00000040 */
#define IAC_IER0_IAIE6                IAC_IER0_IAIE6_Msk
#define IAC_IER0_IAIE7_Pos            (7U)
#define IAC_IER0_IAIE7_Msk            (0x1UL << IAC_IER0_IAIE7_Pos)              /*!< 0x00000080 */
#define IAC_IER0_IAIE7                IAC_IER0_IAIE7_Msk
#define IAC_IER0_IAIE8_Pos            (8U)
#define IAC_IER0_IAIE8_Msk            (0x1UL << IAC_IER0_IAIE8_Pos)              /*!< 0x00000100 */
#define IAC_IER0_IAIE8                IAC_IER0_IAIE8_Msk
#define IAC_IER0_IAIE9_Pos            (9U)
#define IAC_IER0_IAIE9_Msk            (0x1UL << IAC_IER0_IAIE9_Pos)              /*!< 0x00000200 */
#define IAC_IER0_IAIE9                IAC_IER0_IAIE9_Msk
#define IAC_IER0_IAIE10_Pos           (10U)
#define IAC_IER0_IAIE10_Msk           (0x1UL << IAC_IER0_IAIE10_Pos)             /*!< 0x00000400 */
#define IAC_IER0_IAIE10               IAC_IER0_IAIE10_Msk
#define IAC_IER0_IAIE11_Pos           (11U)
#define IAC_IER0_IAIE11_Msk           (0x1UL << IAC_IER0_IAIE11_Pos)             /*!< 0x00000800 */
#define IAC_IER0_IAIE11               IAC_IER0_IAIE11_Msk
#define IAC_IER0_IAIE12_Pos           (12U)
#define IAC_IER0_IAIE12_Msk           (0x1UL << IAC_IER0_IAIE12_Pos)             /*!< 0x00001000 */
#define IAC_IER0_IAIE12               IAC_IER0_IAIE12_Msk
#define IAC_IER0_IAIE13_Pos           (13U)
#define IAC_IER0_IAIE13_Msk           (0x1UL << IAC_IER0_IAIE13_Pos)             /*!< 0x00002000 */
#define IAC_IER0_IAIE13               IAC_IER0_IAIE13_Msk
#define IAC_IER0_IAIE14_Pos           (14U)
#define IAC_IER0_IAIE14_Msk           (0x1UL << IAC_IER0_IAIE14_Pos)             /*!< 0x00004000 */
#define IAC_IER0_IAIE14               IAC_IER0_IAIE14_Msk
#define IAC_IER0_IAIE15_Pos           (15U)
#define IAC_IER0_IAIE15_Msk           (0x1UL << IAC_IER0_IAIE15_Pos)             /*!< 0x00008000 */
#define IAC_IER0_IAIE15               IAC_IER0_IAIE15_Msk
#define IAC_IER0_IAIE16_Pos           (16U)
#define IAC_IER0_IAIE16_Msk           (0x1UL << IAC_IER0_IAIE16_Pos)             /*!< 0x00010000 */
#define IAC_IER0_IAIE16               IAC_IER0_IAIE16_Msk
#define IAC_IER0_IAIE17_Pos           (17U)
#define IAC_IER0_IAIE17_Msk           (0x1UL << IAC_IER0_IAIE17_Pos)             /*!< 0x00020000 */
#define IAC_IER0_IAIE17               IAC_IER0_IAIE17_Msk
#define IAC_IER0_IAIE18_Pos           (18U)
#define IAC_IER0_IAIE18_Msk           (0x1UL << IAC_IER0_IAIE18_Pos)             /*!< 0x00040000 */
#define IAC_IER0_IAIE18               IAC_IER0_IAIE18_Msk
#define IAC_IER0_IAIE19_Pos           (19U)
#define IAC_IER0_IAIE19_Msk           (0x1UL << IAC_IER0_IAIE19_Pos)             /*!< 0x00080000 */
#define IAC_IER0_IAIE19               IAC_IER0_IAIE19_Msk
#define IAC_IER0_IAIE20_Pos           (20U)
#define IAC_IER0_IAIE20_Msk           (0x1UL << IAC_IER0_IAIE20_Pos)             /*!< 0x00100000 */
#define IAC_IER0_IAIE20               IAC_IER0_IAIE20_Msk
#define IAC_IER0_IAIE21_Pos           (21U)
#define IAC_IER0_IAIE21_Msk           (0x1UL << IAC_IER0_IAIE21_Pos)             /*!< 0x00200000 */
#define IAC_IER0_IAIE21               IAC_IER0_IAIE21_Msk
#define IAC_IER0_IAIE22_Pos           (22U)
#define IAC_IER0_IAIE22_Msk           (0x1UL << IAC_IER0_IAIE22_Pos)             /*!< 0x00400000 */
#define IAC_IER0_IAIE22               IAC_IER0_IAIE22_Msk
#define IAC_IER0_IAIE23_Pos           (23U)
#define IAC_IER0_IAIE23_Msk           (0x1UL << IAC_IER0_IAIE23_Pos)             /*!< 0x00800000 */
#define IAC_IER0_IAIE23               IAC_IER0_IAIE23_Msk
#define IAC_IER0_IAIE24_Pos           (24U)
#define IAC_IER0_IAIE24_Msk           (0x1UL << IAC_IER0_IAIE24_Pos)             /*!< 0x01000000 */
#define IAC_IER0_IAIE24               IAC_IER0_IAIE24_Msk
#define IAC_IER0_IAIE25_Pos           (25U)
#define IAC_IER0_IAIE25_Msk           (0x1UL << IAC_IER0_IAIE25_Pos)             /*!< 0x02000000 */
#define IAC_IER0_IAIE25               IAC_IER0_IAIE25_Msk
#define IAC_IER0_IAIE26_Pos           (26U)
#define IAC_IER0_IAIE26_Msk           (0x1UL << IAC_IER0_IAIE26_Pos)             /*!< 0x04000000 */
#define IAC_IER0_IAIE26               IAC_IER0_IAIE26_Msk
#define IAC_IER0_IAIE27_Pos           (27U)
#define IAC_IER0_IAIE27_Msk           (0x1UL << IAC_IER0_IAIE27_Pos)             /*!< 0x08000000 */
#define IAC_IER0_IAIE27               IAC_IER0_IAIE27_Msk
#define IAC_IER0_IAIE28_Pos           (28U)
#define IAC_IER0_IAIE28_Msk           (0x1UL << IAC_IER0_IAIE28_Pos)             /*!< 0x10000000 */
#define IAC_IER0_IAIE28               IAC_IER0_IAIE28_Msk
#define IAC_IER0_IAIE29_Pos           (29U)
#define IAC_IER0_IAIE29_Msk           (0x1UL << IAC_IER0_IAIE29_Pos)             /*!< 0x20000000 */
#define IAC_IER0_IAIE29               IAC_IER0_IAIE29_Msk
#define IAC_IER0_IAIE30_Pos           (30U)
#define IAC_IER0_IAIE30_Msk           (0x1UL << IAC_IER0_IAIE30_Pos)             /*!< 0x40000000 */
#define IAC_IER0_IAIE30               IAC_IER0_IAIE30_Msk
#define IAC_IER0_IAIE31_Pos           (31U)
#define IAC_IER0_IAIE31_Msk           (0x1UL << IAC_IER0_IAIE31_Pos)             /*!< 0x80000000 */
#define IAC_IER0_IAIE31               IAC_IER0_IAIE31_Msk

/*******************  Bits definition for IAC_IER1 register *******************/
#define IAC_IER1_IAIE32_Pos           (0U)
#define IAC_IER1_IAIE32_Msk           (0x1UL << IAC_IER1_IAIE32_Pos)             /*!< 0x00000001 */
#define IAC_IER1_IAIE32               IAC_IER1_IAIE32_Msk
#define IAC_IER1_IAIE33_Pos           (1U)
#define IAC_IER1_IAIE33_Msk           (0x1UL << IAC_IER1_IAIE33_Pos)             /*!< 0x00000002 */
#define IAC_IER1_IAIE33               IAC_IER1_IAIE33_Msk
#define IAC_IER1_IAIE34_Pos           (2U)
#define IAC_IER1_IAIE34_Msk           (0x1UL << IAC_IER1_IAIE34_Pos)             /*!< 0x00000004 */
#define IAC_IER1_IAIE34               IAC_IER1_IAIE34_Msk
#define IAC_IER1_IAIE35_Pos           (3U)
#define IAC_IER1_IAIE35_Msk           (0x1UL << IAC_IER1_IAIE35_Pos)             /*!< 0x00000008 */
#define IAC_IER1_IAIE35               IAC_IER1_IAIE35_Msk
#define IAC_IER1_IAIE36_Pos           (4U)
#define IAC_IER1_IAIE36_Msk           (0x1UL << IAC_IER1_IAIE36_Pos)             /*!< 0x00000010 */
#define IAC_IER1_IAIE36               IAC_IER1_IAIE36_Msk
#define IAC_IER1_IAIE37_Pos           (5U)
#define IAC_IER1_IAIE37_Msk           (0x1UL << IAC_IER1_IAIE37_Pos)             /*!< 0x00000020 */
#define IAC_IER1_IAIE37               IAC_IER1_IAIE37_Msk
#define IAC_IER1_IAIE38_Pos           (6U)
#define IAC_IER1_IAIE38_Msk           (0x1UL << IAC_IER1_IAIE38_Pos)             /*!< 0x00000040 */
#define IAC_IER1_IAIE38               IAC_IER1_IAIE38_Msk
#define IAC_IER1_IAIE39_Pos           (7U)
#define IAC_IER1_IAIE39_Msk           (0x1UL << IAC_IER1_IAIE39_Pos)             /*!< 0x00000080 */
#define IAC_IER1_IAIE39               IAC_IER1_IAIE39_Msk
#define IAC_IER1_IAIE40_Pos           (8U)
#define IAC_IER1_IAIE40_Msk           (0x1UL << IAC_IER1_IAIE40_Pos)             /*!< 0x00000100 */
#define IAC_IER1_IAIE40               IAC_IER1_IAIE40_Msk
#define IAC_IER1_IAIE41_Pos           (9U)
#define IAC_IER1_IAIE41_Msk           (0x1UL << IAC_IER1_IAIE41_Pos)             /*!< 0x00000200 */
#define IAC_IER1_IAIE41               IAC_IER1_IAIE41_Msk
#define IAC_IER1_IAIE42_Pos           (10U)
#define IAC_IER1_IAIE42_Msk           (0x1UL << IAC_IER1_IAIE42_Pos)             /*!< 0x00000400 */
#define IAC_IER1_IAIE42               IAC_IER1_IAIE42_Msk
#define IAC_IER1_IAIE43_Pos           (11U)
#define IAC_IER1_IAIE43_Msk           (0x1UL << IAC_IER1_IAIE43_Pos)             /*!< 0x00000800 */
#define IAC_IER1_IAIE43               IAC_IER1_IAIE43_Msk
#define IAC_IER1_IAIE44_Pos           (12U)
#define IAC_IER1_IAIE44_Msk           (0x1UL << IAC_IER1_IAIE44_Pos)             /*!< 0x00001000 */
#define IAC_IER1_IAIE44               IAC_IER1_IAIE44_Msk
#define IAC_IER1_IAIE45_Pos           (13U)
#define IAC_IER1_IAIE45_Msk           (0x1UL << IAC_IER1_IAIE45_Pos)             /*!< 0x00002000 */
#define IAC_IER1_IAIE45               IAC_IER1_IAIE45_Msk
#define IAC_IER1_IAIE46_Pos           (14U)
#define IAC_IER1_IAIE46_Msk           (0x1UL << IAC_IER1_IAIE46_Pos)             /*!< 0x00004000 */
#define IAC_IER1_IAIE46               IAC_IER1_IAIE46_Msk
#define IAC_IER1_IAIE47_Pos           (15U)
#define IAC_IER1_IAIE47_Msk           (0x1UL << IAC_IER1_IAIE47_Pos)             /*!< 0x00008000 */
#define IAC_IER1_IAIE47               IAC_IER1_IAIE47_Msk
#define IAC_IER1_IAIE48_Pos           (16U)
#define IAC_IER1_IAIE48_Msk           (0x1UL << IAC_IER1_IAIE48_Pos)             /*!< 0x00010000 */
#define IAC_IER1_IAIE48               IAC_IER1_IAIE48_Msk
#define IAC_IER1_IAIE49_Pos           (17U)
#define IAC_IER1_IAIE49_Msk           (0x1UL << IAC_IER1_IAIE49_Pos)             /*!< 0x00020000 */
#define IAC_IER1_IAIE49               IAC_IER1_IAIE49_Msk
#define IAC_IER1_IAIE50_Pos           (18U)
#define IAC_IER1_IAIE50_Msk           (0x1UL << IAC_IER1_IAIE50_Pos)             /*!< 0x00040000 */
#define IAC_IER1_IAIE50               IAC_IER1_IAIE50_Msk
#define IAC_IER1_IAIE51_Pos           (19U)
#define IAC_IER1_IAIE51_Msk           (0x1UL << IAC_IER1_IAIE51_Pos)             /*!< 0x00080000 */
#define IAC_IER1_IAIE51               IAC_IER1_IAIE51_Msk
#define IAC_IER1_IAIE52_Pos           (20U)
#define IAC_IER1_IAIE52_Msk           (0x1UL << IAC_IER1_IAIE52_Pos)             /*!< 0x00100000 */
#define IAC_IER1_IAIE52               IAC_IER1_IAIE52_Msk
#define IAC_IER1_IAIE53_Pos           (21U)
#define IAC_IER1_IAIE53_Msk           (0x1UL << IAC_IER1_IAIE53_Pos)             /*!< 0x00200000 */
#define IAC_IER1_IAIE53               IAC_IER1_IAIE53_Msk
#define IAC_IER1_IAIE54_Pos           (22U)
#define IAC_IER1_IAIE54_Msk           (0x1UL << IAC_IER1_IAIE54_Pos)             /*!< 0x00400000 */
#define IAC_IER1_IAIE54               IAC_IER1_IAIE54_Msk
#define IAC_IER1_IAIE55_Pos           (23U)
#define IAC_IER1_IAIE55_Msk           (0x1UL << IAC_IER1_IAIE55_Pos)             /*!< 0x00800000 */
#define IAC_IER1_IAIE55               IAC_IER1_IAIE55_Msk
#define IAC_IER1_IAIE56_Pos           (24U)
#define IAC_IER1_IAIE56_Msk           (0x1UL << IAC_IER1_IAIE56_Pos)             /*!< 0x01000000 */
#define IAC_IER1_IAIE56               IAC_IER1_IAIE56_Msk
#define IAC_IER1_IAIE57_Pos           (25U)
#define IAC_IER1_IAIE57_Msk           (0x1UL << IAC_IER1_IAIE57_Pos)             /*!< 0x02000000 */
#define IAC_IER1_IAIE57               IAC_IER1_IAIE57_Msk
#define IAC_IER1_IAIE58_Pos           (26U)
#define IAC_IER1_IAIE58_Msk           (0x1UL << IAC_IER1_IAIE58_Pos)             /*!< 0x04000000 */
#define IAC_IER1_IAIE58               IAC_IER1_IAIE58_Msk
#define IAC_IER1_IAIE59_Pos           (27U)
#define IAC_IER1_IAIE59_Msk           (0x1UL << IAC_IER1_IAIE59_Pos)             /*!< 0x08000000 */
#define IAC_IER1_IAIE59               IAC_IER1_IAIE59_Msk
#define IAC_IER1_IAIE60_Pos           (28U)
#define IAC_IER1_IAIE60_Msk           (0x1UL << IAC_IER1_IAIE60_Pos)             /*!< 0x10000000 */
#define IAC_IER1_IAIE60               IAC_IER1_IAIE60_Msk
#define IAC_IER1_IAIE61_Pos           (29U)
#define IAC_IER1_IAIE61_Msk           (0x1UL << IAC_IER1_IAIE61_Pos)             /*!< 0x20000000 */
#define IAC_IER1_IAIE61               IAC_IER1_IAIE61_Msk
#define IAC_IER1_IAIE62_Pos           (30U)
#define IAC_IER1_IAIE62_Msk           (0x1UL << IAC_IER1_IAIE62_Pos)             /*!< 0x40000000 */
#define IAC_IER1_IAIE62               IAC_IER1_IAIE62_Msk
#define IAC_IER1_IAIE63_Pos           (31U)
#define IAC_IER1_IAIE63_Msk           (0x1UL << IAC_IER1_IAIE63_Pos)             /*!< 0x80000000 */
#define IAC_IER1_IAIE63               IAC_IER1_IAIE63_Msk

