STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/*******************  Bits definition for IAC_IER3 register *******************/
#define IAC_IER3_IAIE96_Pos           (0U)
#define IAC_IER3_IAIE96_Msk           (0x1UL << IAC_IER3_IAIE96_Pos)             /*!< 0x00000001 */
#define IAC_IER3_IAIE96               IAC_IER3_IAIE96_Msk
#define IAC_IER3_IAIE97_Pos           (1U)
#define IAC_IER3_IAIE97_Msk           (0x1UL << IAC_IER3_IAIE97_Pos)             /*!< 0x00000002 */
#define IAC_IER3_IAIE97               IAC_IER3_IAIE97_Msk
#define IAC_IER3_IAIE98_Pos           (2U)
#define IAC_IER3_IAIE98_Msk           (0x1UL << IAC_IER3_IAIE98_Pos)             /*!< 0x00000004 */
#define IAC_IER3_IAIE98               IAC_IER3_IAIE98_Msk
#define IAC_IER3_IAIE99_Pos           (3U)
#define IAC_IER3_IAIE99_Msk           (0x1UL << IAC_IER3_IAIE99_Pos)             /*!< 0x00000008 */
#define IAC_IER3_IAIE99               IAC_IER3_IAIE99_Msk
#define IAC_IER3_IAIE100_Pos          (4U)
#define IAC_IER3_IAIE100_Msk          (0x1UL << IAC_IER3_IAIE100_Pos)            /*!< 0x00000010 */
#define IAC_IER3_IAIE100              IAC_IER3_IAIE100_Msk
#define IAC_IER3_IAIE101_Pos          (5U)
#define IAC_IER3_IAIE101_Msk          (0x1UL << IAC_IER3_IAIE101_Pos)            /*!< 0x00000020 */
#define IAC_IER3_IAIE101              IAC_IER3_IAIE101_Msk
#define IAC_IER3_IAIE102_Pos          (6U)
#define IAC_IER3_IAIE102_Msk          (0x1UL << IAC_IER3_IAIE102_Pos)            /*!< 0x00000040 */
#define IAC_IER3_IAIE102              IAC_IER3_IAIE102_Msk
#define IAC_IER3_IAIE103_Pos          (7U)
#define IAC_IER3_IAIE103_Msk          (0x1UL << IAC_IER3_IAIE103_Pos)            /*!< 0x00000080 */
#define IAC_IER3_IAIE103              IAC_IER3_IAIE103_Msk
#define IAC_IER3_IAIE104_Pos          (8U)
#define IAC_IER3_IAIE104_Msk          (0x1UL << IAC_IER3_IAIE104_Pos)            /*!< 0x00000100 */
#define IAC_IER3_IAIE104              IAC_IER3_IAIE104_Msk
#define IAC_IER3_IAIE105_Pos          (9U)
#define IAC_IER3_IAIE105_Msk          (0x1UL << IAC_IER3_IAIE105_Pos)            /*!< 0x00000200 */
#define IAC_IER3_IAIE105              IAC_IER3_IAIE105_Msk
#define IAC_IER3_IAIE106_Pos          (10U)
#define IAC_IER3_IAIE106_Msk          (0x1UL << IAC_IER3_IAIE106_Pos)            /*!< 0x00000400 */
#define IAC_IER3_IAIE106              IAC_IER3_IAIE106_Msk
#define IAC_IER3_IAIE107_Pos          (11U)
#define IAC_IER3_IAIE107_Msk          (0x1UL << IAC_IER3_IAIE107_Pos)            /*!< 0x00000800 */
#define IAC_IER3_IAIE107              IAC_IER3_IAIE107_Msk
#define IAC_IER3_IAIE108_Pos          (12U)
#define IAC_IER3_IAIE108_Msk          (0x1UL << IAC_IER3_IAIE108_Pos)            /*!< 0x00001000 */
#define IAC_IER3_IAIE108              IAC_IER3_IAIE108_Msk
#define IAC_IER3_IAIE109_Pos          (13U)
#define IAC_IER3_IAIE109_Msk          (0x1UL << IAC_IER3_IAIE109_Pos)            /*!< 0x00002000 */
#define IAC_IER3_IAIE109              IAC_IER3_IAIE109_Msk
#define IAC_IER3_IAIE110_Pos          (14U)
#define IAC_IER3_IAIE110_Msk          (0x1UL << IAC_IER3_IAIE110_Pos)            /*!< 0x00004000 */
#define IAC_IER3_IAIE110              IAC_IER3_IAIE110_Msk
#define IAC_IER3_IAIE111_Pos          (15U)
#define IAC_IER3_IAIE111_Msk          (0x1UL << IAC_IER3_IAIE111_Pos)            /*!< 0x00008000 */
#define IAC_IER3_IAIE111              IAC_IER3_IAIE111_Msk
#define IAC_IER3_IAIE112_Pos          (16U)
#define IAC_IER3_IAIE112_Msk          (0x1UL << IAC_IER3_IAIE112_Pos)            /*!< 0x00010000 */
#define IAC_IER3_IAIE112              IAC_IER3_IAIE112_Msk
#define IAC_IER3_IAIE113_Pos          (17U)
#define IAC_IER3_IAIE113_Msk          (0x1UL << IAC_IER3_IAIE113_Pos)            /*!< 0x00020000 */
#define IAC_IER3_IAIE113              IAC_IER3_IAIE113_Msk
#define IAC_IER3_IAIE114_Pos          (18U)
#define IAC_IER3_IAIE114_Msk          (0x1UL << IAC_IER3_IAIE114_Pos)            /*!< 0x00040000 */
#define IAC_IER3_IAIE114              IAC_IER3_IAIE114_Msk
#define IAC_IER3_IAIE115_Pos          (19U)
#define IAC_IER3_IAIE115_Msk          (0x1UL << IAC_IER3_IAIE115_Pos)            /*!< 0x00080000 */
#define IAC_IER3_IAIE115              IAC_IER3_IAIE115_Msk
#define IAC_IER3_IAIE116_Pos          (20U)
#define IAC_IER3_IAIE116_Msk          (0x1UL << IAC_IER3_IAIE116_Pos)            /*!< 0x00100000 */
#define IAC_IER3_IAIE116              IAC_IER3_IAIE116_Msk
#define IAC_IER3_IAIE117_Pos          (21U)
#define IAC_IER3_IAIE117_Msk          (0x1UL << IAC_IER3_IAIE117_Pos)            /*!< 0x00200000 */
#define IAC_IER3_IAIE117              IAC_IER3_IAIE117_Msk
#define IAC_IER3_IAIE118_Pos          (22U)
#define IAC_IER3_IAIE118_Msk          (0x1UL << IAC_IER3_IAIE118_Pos)            /*!< 0x00400000 */
#define IAC_IER3_IAIE118              IAC_IER3_IAIE118_Msk
#define IAC_IER3_IAIE119_Pos          (23U)
#define IAC_IER3_IAIE119_Msk          (0x1UL << IAC_IER3_IAIE119_Pos)            /*!< 0x00800000 */
#define IAC_IER3_IAIE119              IAC_IER3_IAIE119_Msk
#define IAC_IER3_IAIE120_Pos          (24U)
#define IAC_IER3_IAIE120_Msk          (0x1UL << IAC_IER3_IAIE120_Pos)            /*!< 0x01000000 */
#define IAC_IER3_IAIE120              IAC_IER3_IAIE120_Msk
#define IAC_IER3_IAIE121_Pos          (25U)
#define IAC_IER3_IAIE121_Msk          (0x1UL << IAC_IER3_IAIE121_Pos)            /*!< 0x02000000 */
#define IAC_IER3_IAIE121              IAC_IER3_IAIE121_Msk
#define IAC_IER3_IAIE122_Pos          (26U)
#define IAC_IER3_IAIE122_Msk          (0x1UL << IAC_IER3_IAIE122_Pos)            /*!< 0x04000000 */
#define IAC_IER3_IAIE122              IAC_IER3_IAIE122_Msk
#define IAC_IER3_IAIE123_Pos          (27U)
#define IAC_IER3_IAIE123_Msk          (0x1UL << IAC_IER3_IAIE123_Pos)            /*!< 0x08000000 */
#define IAC_IER3_IAIE123              IAC_IER3_IAIE123_Msk
#define IAC_IER3_IAIE124_Pos          (28U)
#define IAC_IER3_IAIE124_Msk          (0x1UL << IAC_IER3_IAIE124_Pos)            /*!< 0x10000000 */
#define IAC_IER3_IAIE124              IAC_IER3_IAIE124_Msk
#define IAC_IER3_IAIE125_Pos          (29U)
#define IAC_IER3_IAIE125_Msk          (0x1UL << IAC_IER3_IAIE125_Pos)            /*!< 0x20000000 */
#define IAC_IER3_IAIE125              IAC_IER3_IAIE125_Msk
#define IAC_IER3_IAIE126_Pos          (30U)
#define IAC_IER3_IAIE126_Msk          (0x1UL << IAC_IER3_IAIE126_Pos)            /*!< 0x40000000 */
#define IAC_IER3_IAIE126              IAC_IER3_IAIE126_Msk
#define IAC_IER3_IAIE127_Pos          (31U)
#define IAC_IER3_IAIE127_Msk          (0x1UL << IAC_IER3_IAIE127_Pos)            /*!< 0x80000000 */
#define IAC_IER3_IAIE127              IAC_IER3_IAIE127_Msk

/*******************  Bits definition for IAC_IER4 register *******************/
#define IAC_IER4_IAIE128_Pos          (0U)
#define IAC_IER4_IAIE128_Msk          (0x1UL << IAC_IER4_IAIE128_Pos)            /*!< 0x00000001 */
#define IAC_IER4_IAIE128              IAC_IER4_IAIE128_Msk
#define IAC_IER4_IAIE129_Pos          (1U)
#define IAC_IER4_IAIE129_Msk          (0x1UL << IAC_IER4_IAIE129_Pos)            /*!< 0x00000002 */
#define IAC_IER4_IAIE129              IAC_IER4_IAIE129_Msk
#define IAC_IER4_IAIE130_Pos          (2U)
#define IAC_IER4_IAIE130_Msk          (0x1UL << IAC_IER4_IAIE130_Pos)            /*!< 0x00000004 */
#define IAC_IER4_IAIE130              IAC_IER4_IAIE130_Msk
#define IAC_IER4_IAIE131_Pos          (3U)
#define IAC_IER4_IAIE131_Msk          (0x1UL << IAC_IER4_IAIE131_Pos)            /*!< 0x00000008 */
#define IAC_IER4_IAIE131              IAC_IER4_IAIE131_Msk
#define IAC_IER4_IAIE132_Pos          (4U)
#define IAC_IER4_IAIE132_Msk          (0x1UL << IAC_IER4_IAIE132_Pos)            /*!< 0x00000010 */
#define IAC_IER4_IAIE132              IAC_IER4_IAIE132_Msk
#define IAC_IER4_IAIE133_Pos          (5U)
#define IAC_IER4_IAIE133_Msk          (0x1UL << IAC_IER4_IAIE133_Pos)            /*!< 0x00000020 */
#define IAC_IER4_IAIE133              IAC_IER4_IAIE133_Msk
#define IAC_IER4_IAIE134_Pos          (6U)
#define IAC_IER4_IAIE134_Msk          (0x1UL << IAC_IER4_IAIE134_Pos)            /*!< 0x00000040 */
#define IAC_IER4_IAIE134              IAC_IER4_IAIE134_Msk
#define IAC_IER4_IAIE135_Pos          (7U)
#define IAC_IER4_IAIE135_Msk          (0x1UL << IAC_IER4_IAIE135_Pos)            /*!< 0x00000080 */
#define IAC_IER4_IAIE135              IAC_IER4_IAIE135_Msk
#define IAC_IER4_IAIE136_Pos          (8U)
#define IAC_IER4_IAIE136_Msk          (0x1UL << IAC_IER4_IAIE136_Pos)            /*!< 0x00000100 */
#define IAC_IER4_IAIE136              IAC_IER4_IAIE136_Msk
#define IAC_IER4_IAIE137_Pos          (9U)
#define IAC_IER4_IAIE137_Msk          (0x1UL << IAC_IER4_IAIE137_Pos)            /*!< 0x00000200 */
#define IAC_IER4_IAIE137              IAC_IER4_IAIE137_Msk
#define IAC_IER4_IAIE138_Pos          (10U)
#define IAC_IER4_IAIE138_Msk          (0x1UL << IAC_IER4_IAIE138_Pos)            /*!< 0x00000400 */
#define IAC_IER4_IAIE138              IAC_IER4_IAIE138_Msk
#define IAC_IER4_IAIE139_Pos          (11U)
#define IAC_IER4_IAIE139_Msk          (0x1UL << IAC_IER4_IAIE139_Pos)            /*!< 0x00000800 */
#define IAC_IER4_IAIE139              IAC_IER4_IAIE139_Msk
#define IAC_IER4_IAIE140_Pos          (12U)
#define IAC_IER4_IAIE140_Msk          (0x1UL << IAC_IER4_IAIE140_Pos)            /*!< 0x00001000 */
#define IAC_IER4_IAIE140              IAC_IER4_IAIE140_Msk
#define IAC_IER4_IAIE141_Pos          (13U)
#define IAC_IER4_IAIE141_Msk          (0x1UL << IAC_IER4_IAIE141_Pos)            /*!< 0x00002000 */
#define IAC_IER4_IAIE141              IAC_IER4_IAIE141_Msk
#define IAC_IER4_IAIE142_Pos          (14U)
#define IAC_IER4_IAIE142_Msk          (0x1UL << IAC_IER4_IAIE142_Pos)            /*!< 0x00004000 */
#define IAC_IER4_IAIE142              IAC_IER4_IAIE142_Msk
#define IAC_IER4_IAIE143_Pos          (15U)
#define IAC_IER4_IAIE143_Msk          (0x1UL << IAC_IER4_IAIE143_Pos)            /*!< 0x00008000 */
#define IAC_IER4_IAIE143              IAC_IER4_IAIE143_Msk
#define IAC_IER4_IAIE144_Pos          (16U)
#define IAC_IER4_IAIE144_Msk          (0x1UL << IAC_IER4_IAIE144_Pos)            /*!< 0x00010000 */
#define IAC_IER4_IAIE144              IAC_IER4_IAIE144_Msk
#define IAC_IER4_IAIE145_Pos          (17U)
#define IAC_IER4_IAIE145_Msk          (0x1UL << IAC_IER4_IAIE145_Pos)            /*!< 0x00020000 */
#define IAC_IER4_IAIE145              IAC_IER4_IAIE145_Msk
#define IAC_IER4_IAIE146_Pos          (18U)
#define IAC_IER4_IAIE146_Msk          (0x1UL << IAC_IER4_IAIE146_Pos)            /*!< 0x00040000 */
#define IAC_IER4_IAIE146              IAC_IER4_IAIE146_Msk
#define IAC_IER4_IAIE147_Pos          (19U)
#define IAC_IER4_IAIE147_Msk          (0x1UL << IAC_IER4_IAIE147_Pos)            /*!< 0x00080000 */
#define IAC_IER4_IAIE147              IAC_IER4_IAIE147_Msk
#define IAC_IER4_IAIE148_Pos          (20U)
#define IAC_IER4_IAIE148_Msk          (0x1UL << IAC_IER4_IAIE148_Pos)            /*!< 0x00100000 */
#define IAC_IER4_IAIE148              IAC_IER4_IAIE148_Msk
#define IAC_IER4_IAIE149_Pos          (21U)
#define IAC_IER4_IAIE149_Msk          (0x1UL << IAC_IER4_IAIE149_Pos)            /*!< 0x00200000 */
#define IAC_IER4_IAIE149              IAC_IER4_IAIE149_Msk
#define IAC_IER4_IAIE150_Pos          (22U)
#define IAC_IER4_IAIE150_Msk          (0x1UL << IAC_IER4_IAIE150_Pos)            /*!< 0x00400000 */
#define IAC_IER4_IAIE150              IAC_IER4_IAIE150_Msk
#define IAC_IER4_IAIE151_Pos          (23U)
#define IAC_IER4_IAIE151_Msk          (0x1UL << IAC_IER4_IAIE151_Pos)            /*!< 0x00800000 */
#define IAC_IER4_IAIE151              IAC_IER4_IAIE151_Msk
#define IAC_IER4_IAIE152_Pos          (24U)
#define IAC_IER4_IAIE152_Msk          (0x1UL << IAC_IER4_IAIE152_Pos)            /*!< 0x01000000 */
#define IAC_IER4_IAIE152              IAC_IER4_IAIE152_Msk
#define IAC_IER4_IAIE153_Pos          (25U)
#define IAC_IER4_IAIE153_Msk          (0x1UL << IAC_IER4_IAIE153_Pos)            /*!< 0x02000000 */
#define IAC_IER4_IAIE153              IAC_IER4_IAIE153_Msk
#define IAC_IER4_IAIE154_Pos          (26U)
#define IAC_IER4_IAIE154_Msk          (0x1UL << IAC_IER4_IAIE154_Pos)            /*!< 0x04000000 */
#define IAC_IER4_IAIE154              IAC_IER4_IAIE154_Msk
#define IAC_IER4_IAIE155_Pos          (27U)
#define IAC_IER4_IAIE155_Msk          (0x1UL << IAC_IER4_IAIE155_Pos)            /*!< 0x08000000 */
#define IAC_IER4_IAIE155              IAC_IER4_IAIE155_Msk
#define IAC_IER4_IAIE156_Pos          (28U)
#define IAC_IER4_IAIE156_Msk          (0x1UL << IAC_IER4_IAIE156_Pos)            /*!< 0x10000000 */
#define IAC_IER4_IAIE156              IAC_IER4_IAIE156_Msk
#define IAC_IER4_IAIE157_Pos          (29U)
#define IAC_IER4_IAIE157_Msk          (0x1UL << IAC_IER4_IAIE157_Pos)            /*!< 0x20000000 */
#define IAC_IER4_IAIE157              IAC_IER4_IAIE157_Msk
#define IAC_IER4_IAIE158_Pos          (30U)
#define IAC_IER4_IAIE158_Msk          (0x1UL << IAC_IER4_IAIE158_Pos)            /*!< 0x40000000 */
#define IAC_IER4_IAIE158              IAC_IER4_IAIE158_Msk
#define IAC_IER4_IAIE159_Pos          (31U)
#define IAC_IER4_IAIE159_Msk          (0x1UL << IAC_IER4_IAIE159_Pos)            /*!< 0x80000000 */
#define IAC_IER4_IAIE159              IAC_IER4_IAIE159_Msk

/*******************  Bits definition for IAC_IER5 register *******************/
#define IAC_IER5_IAIE160_Pos          (0U)
#define IAC_IER5_IAIE160_Msk          (0x1UL << IAC_IER5_IAIE160_Pos)            /*!< 0x00000001 */
#define IAC_IER5_IAIE160              IAC_IER5_IAIE160_Msk
#define IAC_IER5_IAIE161_Pos          (1U)
#define IAC_IER5_IAIE161_Msk          (0x1UL << IAC_IER5_IAIE161_Pos)            /*!< 0x00000002 */
#define IAC_IER5_IAIE161              IAC_IER5_IAIE161_Msk
#define IAC_IER5_IAIE162_Pos          (2U)
#define IAC_IER5_IAIE162_Msk          (0x1UL << IAC_IER5_IAIE162_Pos)            /*!< 0x00000004 */
#define IAC_IER5_IAIE162              IAC_IER5_IAIE162_Msk
#define IAC_IER5_IAIE163_Pos          (3U)
#define IAC_IER5_IAIE163_Msk          (0x1UL << IAC_IER5_IAIE163_Pos)            /*!< 0x00000008 */
#define IAC_IER5_IAIE163              IAC_IER5_IAIE163_Msk
#define IAC_IER5_IAIE164_Pos          (4U)
#define IAC_IER5_IAIE164_Msk          (0x1UL << IAC_IER5_IAIE164_Pos)            /*!< 0x00000010 */
#define IAC_IER5_IAIE164              IAC_IER5_IAIE164_Msk
#define IAC_IER5_IAIE165_Pos          (5U)
#define IAC_IER5_IAIE165_Msk          (0x1UL << IAC_IER5_IAIE165_Pos)            /*!< 0x00000020 */
#define IAC_IER5_IAIE165              IAC_IER5_IAIE165_Msk
#define IAC_IER5_IAIE166_Pos          (6U)
#define IAC_IER5_IAIE166_Msk          (0x1UL << IAC_IER5_IAIE166_Pos)            /*!< 0x00000040 */
#define IAC_IER5_IAIE166              IAC_IER5_IAIE166_Msk
#define IAC_IER5_IAIE167_Pos          (7U)
#define IAC_IER5_IAIE167_Msk          (0x1UL << IAC_IER5_IAIE167_Pos)            /*!< 0x00000080 */
#define IAC_IER5_IAIE167              IAC_IER5_IAIE167_Msk
#define IAC_IER5_IAIE168_Pos          (8U)
#define IAC_IER5_IAIE168_Msk          (0x1UL << IAC_IER5_IAIE168_Pos)            /*!< 0x00000100 */
#define IAC_IER5_IAIE168              IAC_IER5_IAIE168_Msk
#define IAC_IER5_IAIE169_Pos          (9U)
#define IAC_IER5_IAIE169_Msk          (0x1UL << IAC_IER5_IAIE169_Pos)            /*!< 0x00000200 */
#define IAC_IER5_IAIE169              IAC_IER5_IAIE169_Msk
#define IAC_IER5_IAIE170_Pos          (10U)
#define IAC_IER5_IAIE170_Msk          (0x1UL << IAC_IER5_IAIE170_Pos)            /*!< 0x00000400 */
#define IAC_IER5_IAIE170              IAC_IER5_IAIE170_Msk
#define IAC_IER5_IAIE171_Pos          (11U)
#define IAC_IER5_IAIE171_Msk          (0x1UL << IAC_IER5_IAIE171_Pos)            /*!< 0x00000800 */
#define IAC_IER5_IAIE171              IAC_IER5_IAIE171_Msk
#define IAC_IER5_IAIE172_Pos          (12U)
#define IAC_IER5_IAIE172_Msk          (0x1UL << IAC_IER5_IAIE172_Pos)            /*!< 0x00001000 */
#define IAC_IER5_IAIE172              IAC_IER5_IAIE172_Msk
#define IAC_IER5_IAIE173_Pos          (13U)
#define IAC_IER5_IAIE173_Msk          (0x1UL << IAC_IER5_IAIE173_Pos)            /*!< 0x00002000 */
#define IAC_IER5_IAIE173              IAC_IER5_IAIE173_Msk
#define IAC_IER5_IAIE174_Pos          (14U)
#define IAC_IER5_IAIE174_Msk          (0x1UL << IAC_IER5_IAIE174_Pos)            /*!< 0x00004000 */
#define IAC_IER5_IAIE174              IAC_IER5_IAIE174_Msk
#define IAC_IER5_IAIE175_Pos          (15U)
#define IAC_IER5_IAIE175_Msk          (0x1UL << IAC_IER5_IAIE175_Pos)            /*!< 0x00008000 */
#define IAC_IER5_IAIE175              IAC_IER5_IAIE175_Msk
#define IAC_IER5_IAIE176_Pos          (16U)
#define IAC_IER5_IAIE176_Msk          (0x1UL << IAC_IER5_IAIE176_Pos)            /*!< 0x00010000 */
#define IAC_IER5_IAIE176              IAC_IER5_IAIE176_Msk
#define IAC_IER5_IAIE177_Pos          (17U)
#define IAC_IER5_IAIE177_Msk          (0x1UL << IAC_IER5_IAIE177_Pos)            /*!< 0x00020000 */
#define IAC_IER5_IAIE177              IAC_IER5_IAIE177_Msk
#define IAC_IER5_IAIE178_Pos          (18U)
#define IAC_IER5_IAIE178_Msk          (0x1UL << IAC_IER5_IAIE178_Pos)            /*!< 0x00040000 */
#define IAC_IER5_IAIE178              IAC_IER5_IAIE178_Msk
#define IAC_IER5_IAIE179_Pos          (19U)
#define IAC_IER5_IAIE179_Msk          (0x1UL << IAC_IER5_IAIE179_Pos)            /*!< 0x00080000 */
#define IAC_IER5_IAIE179              IAC_IER5_IAIE179_Msk
#define IAC_IER5_IAIE180_Pos          (20U)
#define IAC_IER5_IAIE180_Msk          (0x1UL << IAC_IER5_IAIE180_Pos)            /*!< 0x00100000 */
#define IAC_IER5_IAIE180              IAC_IER5_IAIE180_Msk
#define IAC_IER5_IAIE181_Pos          (21U)
#define IAC_IER5_IAIE181_Msk          (0x1UL << IAC_IER5_IAIE181_Pos)            /*!< 0x00200000 */
#define IAC_IER5_IAIE181              IAC_IER5_IAIE181_Msk
#define IAC_IER5_IAIE182_Pos          (22U)
#define IAC_IER5_IAIE182_Msk          (0x1UL << IAC_IER5_IAIE182_Pos)            /*!< 0x00400000 */
#define IAC_IER5_IAIE182              IAC_IER5_IAIE182_Msk
#define IAC_IER5_IAIE183_Pos          (23U)
#define IAC_IER5_IAIE183_Msk          (0x1UL << IAC_IER5_IAIE183_Pos)            /*!< 0x00800000 */
#define IAC_IER5_IAIE183              IAC_IER5_IAIE183_Msk
#define IAC_IER5_IAIE184_Pos          (24U)
#define IAC_IER5_IAIE184_Msk          (0x1UL << IAC_IER5_IAIE184_Pos)            /*!< 0x01000000 */
#define IAC_IER5_IAIE184              IAC_IER5_IAIE184_Msk
#define IAC_IER5_IAIE185_Pos          (25U)
#define IAC_IER5_IAIE185_Msk          (0x1UL << IAC_IER5_IAIE185_Pos)            /*!< 0x02000000 */
#define IAC_IER5_IAIE185              IAC_IER5_IAIE185_Msk
#define IAC_IER5_IAIE186_Pos          (26U)
#define IAC_IER5_IAIE186_Msk          (0x1UL << IAC_IER5_IAIE186_Pos)            /*!< 0x04000000 */
#define IAC_IER5_IAIE186              IAC_IER5_IAIE186_Msk
#define IAC_IER5_IAIE187_Pos          (27U)
#define IAC_IER5_IAIE187_Msk          (0x1UL << IAC_IER5_IAIE187_Pos)            /*!< 0x08000000 */
#define IAC_IER5_IAIE187              IAC_IER5_IAIE187_Msk
#define IAC_IER5_IAIE188_Pos          (28U)
#define IAC_IER5_IAIE188_Msk          (0x1UL << IAC_IER5_IAIE188_Pos)            /*!< 0x10000000 */
#define IAC_IER5_IAIE188              IAC_IER5_IAIE188_Msk
#define IAC_IER5_IAIE189_Pos          (29U)
#define IAC_IER5_IAIE189_Msk          (0x1UL << IAC_IER5_IAIE189_Pos)            /*!< 0x20000000 */
#define IAC_IER5_IAIE189              IAC_IER5_IAIE189_Msk
#define IAC_IER5_IAIE190_Pos          (30U)
#define IAC_IER5_IAIE190_Msk          (0x1UL << IAC_IER5_IAIE190_Pos)            /*!< 0x40000000 */
#define IAC_IER5_IAIE190              IAC_IER5_IAIE190_Msk
#define IAC_IER5_IAIE191_Pos          (31U)
#define IAC_IER5_IAIE191_Msk          (0x1UL << IAC_IER5_IAIE191_Pos)            /*!< 0x80000000 */
#define IAC_IER5_IAIE191              IAC_IER5_IAIE191_Msk

