STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257axx_cm33.h
/********************  Bit definition for TIM_AF1 register  *******************/
#define TIM1_AF1_BKINE_Pos        (0U)
#define TIM1_AF1_BKINE_Msk        (0x1UL << TIM1_AF1_BKINE_Pos)                /*!< 0x00000001 */
#define TIM1_AF1_BKINE            TIM1_AF1_BKINE_Msk                           /*!< BRK BKIN input enable */
#define TIM1_AF1_BKINP_Pos        (9U)
#define TIM1_AF1_BKINP_Msk        (0x1UL << TIM1_AF1_BKINP_Pos)                /*!< 0x00000200 */
#define TIM1_AF1_BKINP            TIM1_AF1_BKINP_Msk                           /*!< BRK BKIN input polarity */
#define TIM1_AF1_ETRSEL_Pos       (14U)
#define TIM1_AF1_ETRSEL_Msk       (0xFUL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x0003C000 */
#define TIM1_AF1_ETRSEL           TIM1_AF1_ETRSEL_Msk                          /*!< ETRSEL[3:0] bits (TIM ETR source selection) */
#define TIM1_AF1_ETRSEL_0         (0x1UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1         (0x2UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2         (0x4UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00010000 */
#define TIM1_AF1_ETRSEL_3         (0x8UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00020000 */

/*------------------------------  TIM1 specific  -----------------------------*/
#define TIM1_AF1_BKMDF1BK0E_Pos   (8U)
#define TIM1_AF1_BKMDF1BK0E_Msk   (0x1UL << TIM1_AF1_BKMDF1BK0E_Pos)           /*!< 0x00000100 */
#define TIM1_AF1_BKMDF1BK0E       TIM1_AF1_BKMDF1BK0E_Msk                      /*!< BRK mdf1_break[0] enable*/

/*------------------------------  TIM8 specific  -----------------------------*/
#define TIM8_AF1_BKMDF1BK2E_Pos   (8U)
#define TIM8_AF1_BKMDF1BK2E_Msk   (0x1UL << TIM8_AF1_BKMDF1BK2E_Pos)           /*!< 0x00000100 */
#define TIM8_AF1_BKMDF1BK2E       TIM8_AF1_BKMDF1BK2E_Msk                      /*!< BRK mdf1_break[2] enable*/

/*-----------------------------  TIM15 specific  -----------------------------*/
#define TIM15_AF1_BKMDF1BK0E_Pos  (8U)
#define TIM15_AF1_BKMDF1BK0E_Msk  (0x1UL << TIM15_AF1_BKMDF1BK0E_Pos)          /*!< 0x00000100 */
#define TIM15_AF1_BKMDF1BK0E      TIM15_AF1_BKMDF1BK0E_Msk                     /*!< BRK mdf1_break[0] enable*/

/*-----------------------------  TIM16 specific  -----------------------------*/
#define TIM16_AF1_BKMDF1BK1E_Pos  (8U)
#define TIM16_AF1_BKMDF1BK1E_Msk  (0x1UL << TIM16_AF1_BKMDF1BK1E_Pos)          /*!< 0x00000100 */
#define TIM16_AF1_BKMDF1BK1E      TIM16_AF1_BKMDF1BK1E_Msk                     /*!< BRK mdf1_break[1] enable*/

/*-----------------------------  TIM17 specific  -----------------------------*/
#define TIM17_AF1_BKMDF1BK2E_Pos  (8U)
#define TIM17_AF1_BKMDF1BK2E_Msk  (0x1UL << TIM17_AF1_BKMDF1BK2E_Pos)          /*!< 0x00000100 */
#define TIM17_AF1_BKMDF1BK2E      TIM16_AF1_BKMDF1BK2E_Msk                     /*!< BRK mdf1_break[2] enable*/

/*-----------------------------  TIM20 specific  -----------------------------*/
#define TIM20_AF1_BKMDF1BK2E_Pos  (8U)
#define TIM20_AF1_BKMDF1BK2E_Msk  (0x1UL << TIM20_AF1_BKMDF1BK0E_Pos)          /*!< 0x00000100 */
#define TIM20_AF1_BKMDF1BK2E      TIM20_AF1_BKMDF1BK0E_Msk                     /*!< BRK mdf1_break[0] enable*/

/******************  Bit definition for TIM_AF2 register  *********************/
#define TIM1_AF2_BK2INE_Pos       (0U)
#define TIM1_AF2_BK2INE_Msk       (0x1UL << TIM1_AF2_BK2INE_Pos)               /*!< 0x00000001 */
#define TIM1_AF2_BK2INE           TIM1_AF2_BK2INE_Msk                          /*!< BRK2 BKIN input enable */
#define TIM1_AF2_BK2INP_Pos       (9U)
#define TIM1_AF2_BK2INP_Msk       (0x1UL << TIM1_AF2_BK2INP_Pos)               /*!< 0x00000200 */
#define TIM1_AF2_BK2INP           TIM1_AF2_BK2INP_Msk                          /*!< BRK2 BKIN input polarity */
#define TIM1_AF2_OCRSEL_Pos       (16U)
#define TIM1_AF2_OCRSEL_Msk       (0x7UL << TIM1_AF2_OCRSEL_Pos)               /*!< 0x00070000 */
#define TIM1_AF2_OCRSEL           TIM1_AF2_OCRSEL_Msk                          /*!< ocref_clr source selection */

/*------------------------------  TIM1 specific  -----------------------------*/
#define TIM1_AF2_BK2MDF1BK1E_Pos  (8U)
#define TIM1_AF2_BK2MDF1BK1E_Msk  (0x1UL << TIM1_AF2_BK2MDF1BK1E_Pos)          /*!< 0x00000100 */
#define TIM1_AF2_BK2MDF1BK1E      TIM1_AF2_BK2MDF1BK1E_Msk                     /*!< BRK2 mdf1_break[1] enable */

/*-(----------------------------  TIM8 specific  -----------------------------*/
#define TIM8_AF2_BK2MDF1BK3E_Pos  (8U)
#define TIM8_AF2_BK2MDF1BK3E_Msk  (0x1UL << TIM8_AF2_BK2MDF1BK3E_Pos)          /*!< 0x00000100 */
#define TIM8_AF2_BK2MDF1BK3E      TIM8_AF2_BK2MDF1BK3E_Msk                     /*!< BRK2 mdf1_break[3] enable */

/*-----------------------------  TIM20 specific  -----------------------------*/
#define TIM20_AF2_BK2MDF1BK1E_Pos (8U)
#define TIM20_AF2_BK2MDF1BK1E_Msk (0x1UL << TIM20_AF2_BK2MDF1BK1E_Pos)         /*!< 0x00000100 */
#define TIM20_AF2_BK2MDF1BK1E     TIM20_AF2_BK2MDF1BK1E_Msk                    /*!< BRK2 mdf1_break[1] enable */

/*******************  Bit definition for TIM_DCR register  ********************/
#define TIM_DCR_DBA_Pos           (0U)
#define TIM_DCR_DBA_Msk           (0x1FUL << TIM_DCR_DBA_Pos)                  /*!< 0x0000001F */
#define TIM_DCR_DBA               TIM_DCR_DBA_Msk                              /*!< DBA[4:0] bits (DMA Base Address) */
#define TIM_DCR_DBA_0             (0x01UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000001 */
#define TIM_DCR_DBA_1             (0x02UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000002 */
#define TIM_DCR_DBA_2             (0x04UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000004 */
#define TIM_DCR_DBA_3             (0x08UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000008 */
#define TIM_DCR_DBA_4             (0x10UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000010 */
#define TIM_DCR_DBL_Pos           (8U)
#define TIM_DCR_DBL_Msk           (0x1FUL << TIM_DCR_DBL_Pos)                  /*!< 0x00001F00 */
#define TIM_DCR_DBL               TIM_DCR_DBL_Msk                              /*!< DBL[4:0] bits (DMA Burst Length) */
#define TIM_DCR_DBL_0             (0x01UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000100 */
#define TIM_DCR_DBL_1             (0x02UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000200 */
#define TIM_DCR_DBL_2             (0x04UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000400 */
#define TIM_DCR_DBL_3             (0x08UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000800 */
#define TIM_DCR_DBL_4             (0x10UL << TIM_DCR_DBL_Pos)                  /*!< 0x00001000 */
#define TIM_DCR_DBSS_Pos          (16U)
#define TIM_DCR_DBSS_Msk          (0xFUL << TIM_DCR_DBSS_Pos)                  /*!< 0x00000F00 */
#define TIM_DCR_DBSS               TIM_DCR_DBSS_Msk                            /*!< DBSS[19:16] bits (DMA Burst Source Selection) */
#define TIM_DCR_DBSS_0            (0x01UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000100 */
#define TIM_DCR_DBSS_1            (0x02UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000200 */
#define TIM_DCR_DBSS_2            (0x04UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000400 */
#define TIM_DCR_DBSS_3            (0x08UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000800 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define TIM_DMAR_DMAB_Pos         (0U)
#define TIM_DMAR_DMAB_Msk         (0xFFFFFFFFUL << TIM_DMAR_DMAB_Pos)          /*!< 0xFFFFFFFF */
#define TIM_DMAR_DMAB             TIM_DMAR_DMAB_Msk                            /*!< DMA register for burst accesses */

/******************  Bits definition for TIM_HWCFGR2 register  ****************/
#define TIM_HWCFGR2_PSC_LINEAR_Pos     (0U)
#define TIM_HWCFGR2_PSC_LINEAR_Msk     (0xFUL << TIM_HWCFGR2_PSC_LINEAR_Pos)   /*!< 0x0000000F */
#define TIM_HWCFGR2_PSC_LINEAR         TIM_HWCFGR2_PSC_LINEAR_Msk              /*!< Option register number */
#define TIM_HWCFGR2_PSC_WIDTH16_Pos    (4U)
#define TIM_HWCFGR2_PSC_WIDTH16_Msk    (0xFUL << TIM_HWCFGR2_PSC_WIDTH16_Pos)  /*!< 0x000000F0 */
#define TIM_HWCFGR2_PSC_WIDTH16        TIM_HWCFGR2_PSC_WIDTH16_Msk             /*!< Prescaler width */
#define TIM_HWCFGR2_CNT_WIDTH_Pos      (8U)
#define TIM_HWCFGR2_CNT_WIDTH_Msk      (0xFFUL << TIM_HWCFGR2_CNT_WIDTH_Pos)   /*!< 0x0000FF00 */
#define TIM_HWCFGR2_CNT_WIDTH          TIM_HWCFGR2_CNT_WIDTH_Msk               /*!< Counter width */
#define TIM_HWCFGR2_OPTIONREG_OUT_Pos  (16U)
#define TIM_HWCFGR2_OPTIONREG_OUT_Msk  (0xFFUL << TIM_HWCFGR2_OPTIONREG_OUT_Pos) /*!< 0x00FF0000 */
#define TIM_HWCFGR2_OPTIONREG_OUT      TIM_HWCFGR2_OPTIONREG_OUT_Msk           /*!< Option register number */

/*****************  Bits definition for TIM_HWCFGR1 register  *****************/
#define TIM_HWCFGR1_NB_OF_CC_Pos    (0U)
#define TIM_HWCFGR1_NB_OF_CC_Msk    (0xFUL << TIM_HWCFGR1_NB_OF_CC_Pos)        /*!< 0x0000000F */
#define TIM_HWCFGR1_NB_OF_CC        TIM_HWCFGR1_NB_OF_CC_Msk                   /*!< Number of capture / compare channel */
#define TIM_HWCFGR1_NB_OF_DT_Pos    (4U)
#define TIM_HWCFGR1_NB_OF_DT_Msk    (0xFUL << TIM_HWCFGR1_NB_OF_DT_Pos)        /*!< 0x000000F0 */
#define TIM_HWCFGR1_NB_OF_DT        TIM_HWCFGR1_NB_OF_DT_Msk                   /*!< Number of complementary outputs and dead-time generators */
#define TIM_HWCFGR1_NB_OF_SM_Pos    (8U)
#define TIM_HWCFGR1_NB_OF_SM_Msk    (0xFUL << TIM_HWCFGR1_NB_OF_SM_Pos)        /*!< 0x00000F00 */
#define TIM_HWCFGR1_NB_OF_SM        TIM_HWCFGR1_NB_OF_SM_Msk                   /*!< Number of synchronization module */
#define TIM_HWCFGR1_RCR_IMPL_Pos    (12U)
#define TIM_HWCFGR1_RCR_IMPL_Msk    (0xFUL << TIM_HWCFGR1_RCR_IMPL_Pos)        /*!< 0x0000F000 */
#define TIM_HWCFGR1_RCR_IMPL        TIM_HWCFGR1_RCR_IMPL_Msk                   /*!< Repetition counter implementation */
#define TIM_HWCFGR1_ETR_IMPL_Pos    (16U)
#define TIM_HWCFGR1_ETR_IMPL_Msk    (0xFUL << TIM_HWCFGR1_ETR_IMPL_Pos)        /*!< 0x000F0000 */
#define TIM_HWCFGR1_ETR_IMPL        TIM_HWCFGR1_ETR_IMPL_Msk                   /*!< External trigger implementation */
#define TIM_HWCFGR1_BK_IMPL_Pos     (20U)
#define TIM_HWCFGR1_BK_IMPL_Msk     (0xFUL << TIM_HWCFGR1_BK_IMPL_Pos)         /*!< 0x00F00000 */
#define TIM_HWCFGR1_BK_IMPL         TIM_HWCFGR1_BK_IMPL_Msk                    /*!< Break circuit implementation */
#define TIM_HWCFGR1_DMA_IMPL_Pos    (24U)
#define TIM_HWCFGR1_DMA_IMPL_Msk    (0xFUL << TIM_HWCFGR1_DMA_IMPL_Pos)        /*!< 0x0F000000 */
#define TIM_HWCFGR1_DMA_IMPL        TIM_HWCFGR1_DMA_IMPL_Msk                   /*!< DMA features implementation */
#define TIM_HWCFGR1_CNT_DIR_Pos     (28U)
#define TIM_HWCFGR1_CNT_DIR_Msk     (0xFUL << TIM_HWCFGR1_CNT_DIR_Pos)         /*!< 0xF0000000 */
#define TIM_HWCFGR1_CNT_DIR         TIM_HWCFGR1_CNT_DIR_Msk                    /*!< Counter direction */

/*******************  Bits definition for TIM_VERR register  ******************/
#define TIM_VERR_MINREV_Pos            (0U)
#define TIM_VERR_MINREV_Msk            (0x4UL << TIM_VERR_MINREV_Pos)          /*!< 0x0000000F */
#define TIM_VERR_MINREV                TIM_VERR_MINREV_Msk                     /*!< TIM Minor version */
#define TIM_VERR_MAJREV_Pos            (4U)
#define TIM_VERR_MAJREV_Msk            (0x4UL << TAMPC_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define TIM_VERR_MAJREV                TIM_VERR_MAJREV_Msk                     /*!< TIM Major version */

/******************  Bits definition for TIM_IPIDR register  ******************/
#define TIM_IPIDR_ID_Pos               (0U)
#define TIM_IPIDR_ID_Msk               (0xFFFFFFFFUL << TIM_IPIDR_ID_Pos)      /*!< 0xFFFFFFFF */
#define TIM_IPIDR_ID                   TIM_IPIDR_ID_Msk                        /*!< TIM ID */

/******************  Bits definition for TAMP_SIDR register  ******************/
#define TIM_SIDR_SID_Pos               (0U)
#define TIM_SIDR_SID_Msk               (0xFFFFFFFFUL << TIM_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define TIM_SIDR_SID                   TIM_SIDR_SID_Msk                        /*!< TIM Size ID */

/******************************************************************************/
/*                                                                            */
/*                                    UCPD                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for UCPD_CFG1 register  *******************/
#define UCPD_CFG1_HBITCLKDIV_Pos            (0U)
#define UCPD_CFG1_HBITCLKDIV_Msk            (0x3FUL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x0000003F */
#define UCPD_CFG1_HBITCLKDIV                UCPD_CFG1_HBITCLKDIV_Msk             /*!< Number of cycles (minus 1) for a half bit clock */
#define UCPD_CFG1_HBITCLKDIV_0              (0x01UL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x00000001 */
#define UCPD_CFG1_HBITCLKDIV_1              (0x02UL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x00000002 */
#define UCPD_CFG1_HBITCLKDIV_2              (0x04UL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x00000004 */
#define UCPD_CFG1_HBITCLKDIV_3              (0x08UL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x00000008 */
#define UCPD_CFG1_HBITCLKDIV_4              (0x10UL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x00000010 */
#define UCPD_CFG1_HBITCLKDIV_5              (0x20UL << UCPD_CFG1_HBITCLKDIV_Pos) /*!< 0x00000020 */
#define UCPD_CFG1_IFRGAP_Pos                (6U)
#define UCPD_CFG1_IFRGAP_Msk                (0x1FUL << UCPD_CFG1_IFRGAP_Pos)     /*!< 0x000007C0 */
#define UCPD_CFG1_IFRGAP                    UCPD_CFG1_IFRGAP_Msk                 /*!< Clock divider value to generates Interframe gap */
#define UCPD_CFG1_IFRGAP_0                  (0x01UL << UCPD_CFG1_IFRGAP_Pos)     /*!< 0x00000040 */
#define UCPD_CFG1_IFRGAP_1                  (0x02UL << UCPD_CFG1_IFRGAP_Pos)     /*!< 0x00000080 */
#define UCPD_CFG1_IFRGAP_2                  (0x04UL << UCPD_CFG1_IFRGAP_Pos)     /*!< 0x00000100 */
#define UCPD_CFG1_IFRGAP_3                  (0x08UL << UCPD_CFG1_IFRGAP_Pos)     /*!< 0x00000200 */
#define UCPD_CFG1_IFRGAP_4                  (0x10UL << UCPD_CFG1_IFRGAP_Pos)     /*!< 0x00000400 */
#define UCPD_CFG1_TRANSWIN_Pos              (11U)
#define UCPD_CFG1_TRANSWIN_Msk              (0x1FUL << UCPD_CFG1_TRANSWIN_Pos)   /*!< 0x0000F800 */
#define UCPD_CFG1_TRANSWIN                  UCPD_CFG1_TRANSWIN_Msk               /*!< Number of cycles (minus 1) of the half bit clock */
#define UCPD_CFG1_TRANSWIN_0                (0x01UL << UCPD_CFG1_TRANSWIN_Pos)   /*!< 0x00000800 */
#define UCPD_CFG1_TRANSWIN_1                (0x02UL << UCPD_CFG1_TRANSWIN_Pos)   /*!< 0x00001000 */
#define UCPD_CFG1_TRANSWIN_2                (0x04UL << UCPD_CFG1_TRANSWIN_Pos)   /*!< 0x00002000 */
#define UCPD_CFG1_TRANSWIN_3                (0x08UL << UCPD_CFG1_TRANSWIN_Pos)   /*!< 0x00004000 */
#define UCPD_CFG1_TRANSWIN_4                (0x10UL << UCPD_CFG1_TRANSWIN_Pos)   /*!< 0x00008000 */
#define UCPD_CFG1_PSC_UCPDCLK_Pos           (17U)
#define UCPD_CFG1_PSC_UCPDCLK_Msk           (0x7UL << UCPD_CFG1_PSC_UCPDCLK_Pos) /*!< 0x000E0000 */
#define UCPD_CFG1_PSC_UCPDCLK               UCPD_CFG1_PSC_UCPDCLK_Msk            /*!< Prescaler for UCPDCLK */
#define UCPD_CFG1_PSC_UCPDCLK_0             (0x1UL << UCPD_CFG1_PSC_UCPDCLK_Pos) /*!< 0x00020000 */
#define UCPD_CFG1_PSC_UCPDCLK_1             (0x2UL << UCPD_CFG1_PSC_UCPDCLK_Pos) /*!< 0x00040000 */
#define UCPD_CFG1_PSC_UCPDCLK_2             (0x4UL << UCPD_CFG1_PSC_UCPDCLK_Pos) /*!< 0x00080000 */
#define UCPD_CFG1_RXORDSETEN_Pos            (20U)
#define UCPD_CFG1_RXORDSETEN_Msk            (0x1FFUL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x1FF00000 */
#define UCPD_CFG1_RXORDSETEN                UCPD_CFG1_RXORDSETEN_Msk             /*!< Receiver ordered set detection enable */
#define UCPD_CFG1_RXORDSETEN_0              (0x001UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x00100000 */
#define UCPD_CFG1_RXORDSETEN_1              (0x002UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x00200000 */
#define UCPD_CFG1_RXORDSETEN_2              (0x004UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x00400000 */
#define UCPD_CFG1_RXORDSETEN_3              (0x008UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x00800000 */
#define UCPD_CFG1_RXORDSETEN_4              (0x010UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x01000000 */
#define UCPD_CFG1_RXORDSETEN_5              (0x020UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x02000000 */
#define UCPD_CFG1_RXORDSETEN_6              (0x040UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x04000000 */
#define UCPD_CFG1_RXORDSETEN_7              (0x080UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x08000000 */
#define UCPD_CFG1_RXORDSETEN_8              (0x100UL << UCPD_CFG1_RXORDSETEN_Pos)/*!< 0x10000000 */
#define UCPD_CFG1_TXDMAEN_Pos               (29U)
#define UCPD_CFG1_TXDMAEN_Msk               (0x1UL << UCPD_CFG1_TXDMAEN_Pos)     /*!< 0x20000000 */
#define UCPD_CFG1_TXDMAEN                   UCPD_CFG1_TXDMAEN_Msk                /*!< DMA transmission requests enable   */
#define UCPD_CFG1_RXDMAEN_Pos               (30U)
#define UCPD_CFG1_RXDMAEN_Msk               (0x1UL << UCPD_CFG1_RXDMAEN_Pos)     /*!< 0x40000000 */
#define UCPD_CFG1_RXDMAEN                   UCPD_CFG1_RXDMAEN_Msk                /*!< DMA reception requests enable   */
#define UCPD_CFG1_UCPDEN_Pos                (31U)
#define UCPD_CFG1_UCPDEN_Msk                (0x1UL << UCPD_CFG1_UCPDEN_Pos)      /*!< 0x80000000 */
#define UCPD_CFG1_UCPDEN                    UCPD_CFG1_UCPDEN_Msk                 /*!< USB Power Delivery Block Enable */

/********************  Bits definition for UCPD_CFG2 register  *******************/
#define UCPD_CFG2_RXFILTDIS_Pos             (0U)
#define UCPD_CFG2_RXFILTDIS_Msk             (0x1UL << UCPD_CFG2_RXFILTDIS_Pos)   /*!< 0x00000001 */
#define UCPD_CFG2_RXFILTDIS                 UCPD_CFG2_RXFILTDIS_Msk              /*!< Enables an Rx pre-filter for the BMC decoder */
#define UCPD_CFG2_RXFILT2N3_Pos             (1U)
#define UCPD_CFG2_RXFILT2N3_Msk             (0x1UL << UCPD_CFG2_RXFILT2N3_Pos)   /*!< 0x00000002 */
#define UCPD_CFG2_RXFILT2N3                 UCPD_CFG2_RXFILT2N3_Msk              /*!< Controls the sampling method for an Rx pre-filter for the BMC decode */
#define UCPD_CFG2_FORCECLK_Pos              (2U)
#define UCPD_CFG2_FORCECLK_Msk              (0x1UL << UCPD_CFG2_FORCECLK_Pos)    /*!< 0x00000004 */
#define UCPD_CFG2_FORCECLK                  UCPD_CFG2_FORCECLK_Msk               /*!< Controls forcing of the clock request UCPDCLK_REQ */
#define UCPD_CFG2_WUPEN_Pos                 (3U)
#define UCPD_CFG2_WUPEN_Msk                 (0x1UL << UCPD_CFG2_WUPEN_Pos)       /*!< 0x00000008 */
#define UCPD_CFG2_WUPEN                     UCPD_CFG2_WUPEN_Msk                  /*!< Wakeup from STOP enable */
#define UCPD_CFG2_RXAFILTEN_Pos             (8U)
#define UCPD_CFG2_RXAFILTEN_Msk             (0x1UL << UCPD_CFG2_RXAFILTEN_Pos)   /*!< 0x00000100 */
#define UCPD_CFG2_RXAFILTEN                 UCPD_CFG2_RXAFILTEN_Msk              /*!< RX Analog Filter enable */

